[
  "Arnold Schonberg suffered from triskaidecaphobia, the fear of the number 13.  He died at 13 minutes from midnight on Friday the 13th.",
  "A crocodile cannot stick its tongue out.",
  "The name for Oz in the \"Wizard of Oz\" was thought up when the creator, Frank Baum, looked at his filing cabinet and saw A-N, and O-Z; hence the name \"OZ.\"",
  "There are 336 dimples on a regulation golf ball.",
  "400-quarter pounders can be made from 1 cow.",
  "Length of beard an average man would grow if he never shaved 27.5 feet",
  "Some individuals express concern sharing their soap, rightly so, considering 75% of all people wash from top to bottom.",
  "The following sentence: `A rough-coated, dough-faced, thoughtful ploughman strode through the streets of Scarborough; after falling into a slough, he coughed and hiccoughed.` Contains the nine different pronunciations of \"ough\" in the English Language.",
  "The average American looks at eight houses before buying one.",
  "Hong Kong holds the most Rolls Royce’s per capita.",
  "South Dakota is the only U.S state which shares no letters with the name of it`s capital",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "Half of all Americans live within 50 miles of their birthplace.",
  "Peanuts actually grow underground, as opposed to nuts like walnuts, almonds, etc. that grow on trees (and are sometimes referred to as \"tree nuts\"). Peanuts, along with beans and peas, belong to the single plant family, Leguminosae. Legumes are edible seeds enclosed in pods.",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "Prince Charles is an avid collecter of toilet seats.",
  "You were born with 300 bones, but by the time you are an adult you will only have 206.",
  "Most American car horns honk in the key of F.",
  "Since 1978, 37 people have died by Vending Machine`s falling on them.  13 people are killed annually.  All this while trying to shake merchandise out of them. 113 people have been injured.",
  "There are 1 million ants for every human in the world."
]