[
  "THE MOST UNUSUAL CANNONBALL: On two occasions, Miss `Rita Thunderbird` remained inside the cannon despite a lot of gunpowder encouragement to do otherwise. She performed in a gold lamé bikini and on one of the two occasions (1977) Miss Thunderbird remained lodged in the cannon, while her bra was shot across the Thames River.",
  "Dolphins sleep with one eye open!",
  "The site with the highest number of women visitors between the age of 35 and 44 years old: Alka-Seltzer.com",
  "Babies are most likely to be born on Tuesdays.",
  "The only nation whose name begins with an \"A\", but doesn`t end in an \"A\" is Afghanistan.",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\"",
  "Telly Savalas and Louis Armstrong died on their birthdays.  ",
  "Americans travel 1,144,721,000 miles by air every day",
  "The Eisenhower interstate system requires that one mile in every five must be straight in case of war or emergency, they could be used as airstrips.",
  "In a test performed by Canadian scientists, using various different styles of music, it was determined that chickens lay the most eggs when pop music was played.",
  "To Ensure Promptness, one is expected to pay beyond the value of service – hence the later abbreviation: T.I.P.",
  "One-fourth of the world`s population lives on less than $200 a year.  Ninety million people survive on less than $75 a year.",
  "Jefferson invented the dumbwaiter, the monetary system, and the folding attic ladder.",
  "Donald Duck comics were banned from Finland because he doesn`t wear pants!",
  "If you went out into space, you would explode before you suffocated because there`s no air pressure.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "Mosquito repellents don`t repel. They hide you. The spray blocks the mosquito`s sensors so they don`t know you`re there.",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game.",
  "Maine is the only state whose name is just one syllable.",
  "You spend 7 years of your life in the bathroom."
]