[
  "In every episode of Seinfeld there is a Superman somewhere.",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "A family of 26 could go to the movies in Mexico city for the price of one in Tokyo.",
  "The letters KGB stand for Komitet Gosudarstvennoy Bezopasnosti.  ",
  "Only female mosquito’s` bite and most are attracted to the color blue twice as much as to any other color.",
  "When the University of Nebraska Cornhuskers play football at home, the stadium becomes the state`s third largest city.",
  "Crocodiles and alligators are surprisingly fast on land.  Although they are rapid, they are not agile.  So, if being chased by one, run in a zigzag line to lose him or her.",
  "To \"testify\" was based on men in the Roman court swearing to a statement made by swearing on their testicles.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "Peanuts are one of the ingredients of dynamite.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "The first song played on Armed Forces Radio during operation Desert Shield was \"Rock the Casba\" by the Clash.",
  "Some lions mate over 50 times a day.",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "Odds of being killed by lightening? 1 in 2million/killed in a car crash? 1 in 5,000/killed by falling out of bed? 1 in 2million/killed in a plane crash? 1 in 25 million.",
  "Spain leads the world in cork production",
  "Americans travel 1,144,721,000 miles by air every day",
  "Who`s that playing the piano on the \"Mad About You\" theme? Paul Reiser himself."
]