[
  "Almonds are a member of the peach family.",
  "Each month, there is at least one report of UFOs from each province of Canada.",
  "Mel Blanc (the voice of Bugs Bunny) was allergic to carrots.",
  "Mozart wrote the nursery rhyme `twinkle, twinkle, little star` at the age of 5.",
  "Intelligent people have more zinc and copper in their hair.",
  "Pearls melt in vinegar.",
  "Every acre of American crops harvested contains 100 pounds of insects.",
  "The longest place-name still in use is: Taumatawhakatangihangakoauauotamateaturipukakapikimaungahoronukupokaiakitnatahu, a New Zealand hill.  ",
  "Steely Dan got their name from a sexual device depicted in the book `The Naked Lunch`.  ",
  "Clownfish, wrasses, moray eels, gobies and other fish species are known to change sex, including reproductive functions. A school of clownfish is always built into a hierarchy with a female fish at the top. When she dies, the most dominant male changes sex and takes her place.",
  "The longest word in the English language, according to the Oxford English Dictionary, is: pneumonoultramicroscopicsilicovolcanoconiosis..  ",
  "Thomas Edison, acclaimed inventor of the light bulb, was afraid of the dark.",
  "If you have three quarters, four dimes, and four pennies, you have $1.19, the largest amount of money in coins without being able to make change for a dollar.",
  "Only female mosquito’s` bite and most are attracted to the color blue twice as much as to any other color.",
  "Babies are most likely to be born on Tuesdays.",
  "The placement of a donkey`s eyes in its` heads enables it to see all four feet at all times!",
  "100% of lottery winners do gain weight",
  "More bullets were fired in `Starship Troopers` than any other movie ever made.",
  "The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary, because when it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites.",
  "In the United States, a pound of potato chips costs two hundred times more than a pound of potatoes."
]