[
  "You can sail all the way around the world at latitude 60 degrees south.",
  "The giant squid has the largest eyes in the world.",
  "All polar bears are left-handed.",
  "Venus is the only planet that rotates clockwise.",
  "On the ground, a group of geese is a gaggle, in the sky it is a skein.",
  "The first automobile race ever seen in the United States was held in Chicago in 1895. The track ran from Chicago to Evanston, Illinois. The winner was J. Frank Duryea, whose average speed was 71/2 miles per hour.",
  "Men can read smaller print than women; women can hear better.",
  "Cats have over one hundred vocal sounds, while dogs only have about ten.",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes.",
  "Honeybees have a type of hair on their eyes!",
  "The storage capacity of human brain exceeds 4 Terabytes.",
  "166,875,000,000 pieces of mail are delivered each year in the US",
  "An eighteenth-century German named Matthew Birchinger, known as \"the little man of Nuremberg,\" played four musical instruments including the bagpipes, was an expert calligrapher, and was the most famous stage magician of his day. He performed tricks with the cup and balls that have never been explained. Yet Birchinger had no hands, legs, or thighs, and was less than 29 inches tall.",
  "If one spells out numbers, they would have to count to One Thousand before coming across the letter \"A\".",
  "Some individuals express concern sharing their soap, rightly so, considering 75% of all people wash from top to bottom.",
  "Approximately every seven minutes of every day, someone in an aerobics class pulls their hamstring.",
  "In 1986 Congress & President Ronald Reagan signed Public Law 99-359, which changed Daylight Saving Time from the last Sunday in April to the first Sunday in April.  It was estimated to save the nation about 300,000 barrels of oil each year by adding most of the month April to D.S.T.",
  "Cranberries are sorted for ripeness by bouncing them; a fully ripened cranberry can be dribbled like a basketball.  ",
  "Mr. Rogers is an ordained minister.",
  "101 Dalmatians, Peter Pan, Lady and the Tramp, and Mulan are the only Disney cartoons where both parents are present and don`t die throughout the movie."
]