[
  "Deborah Winger did the voice of E.T.",
  "In the United States, a pound of potato chips costs two hundred times more than a pound of potatoes.",
  "The 3 most valuable brand names on earth are Marlboro, Coca-Cola, and Budweiser (in that order).",
  "All polar bears are left-handed.",
  "Former basketball superstar Michael Jordan is the most recognized face in the world, more than the pope himself.",
  "The following sentence: `A rough-coated, dough-faced, thoughtful ploughman strode through the streets of Scarborough; after falling into a slough, he coughed and hiccoughed.` Contains the nine different pronunciations of \"ough\" in the English Language.",
  "%60 of all people using the Internet, use it for pornography.",
  "The king of hearts is the only king without a mustache.",
  "More people are killed annually by donkeys than airplane crashes.",
  "The Earth experiences 50,000 Earth quakes per year and is hit by Lightning 100 times a second.",
  "In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world.",
  "Honeybees have a type of hair on their eyes!",
  "A crocodile cannot stick its tongue out.",
  "When the French Academy was preparing its first dictionary, it defined \"crab\" as, \"A small red fish, which walks backwards.\" This definition was sent with a number of others to the naturalist Cuvier for his approval. The scientist wrote back, \"Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards.\"",
  "In eighteenth-century English gambling dens, there was an employee whose only job was to swallow the dice if there was a police raid.",
  "The U.S. military operates 234 golf courses",
  "The \"save\" icon on Microsoft Word shows a floppy disk with the shutter on backwards.",
  "Napoleon`s penis was sold to an American Urologist for $40,000.",
  "Celery has negative calories! It takes more calories to eat a piece of celery than the celery has in it."
]