[
  "10,000 Dutch cows pass through the Amsterdam airport each year.",
  "If you yelled for 8 years, 7 months and 6 days, you will have produced enough sound energy to heat one cup of coffee.",
  "\"Underground\" is the only word in the English language that begins and ends with the letters \"und\"",
  "Maine is the only state whose name is just one syllable.",
  "February 1865 is the only month in recorded history not to have a full moon.",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game.",
  "The only nation whose name begins with an \"A\", but doesn`t end in an \"A\" is Afghanistan.",
  "Steely Dan got their name from a sexual device depicted in the book `The Naked Lunch`.  ",
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "The electric chair was invented by a dentist.",
  "It was discovered on a space mission that a frog can throw up. The frog throws up its stomach first, so the stomach is dangling out of its mouth. Then the frog uses its forearms to dig out all of the stomach`s contents and then swallows the stomach back down.",
  "60% of electrocutions occur while talking on the telephone during a thunderstorm.",
  "Former basketball superstar Michael Jordan is the most recognized face in the world, more than the pope himself.",
  "The mask worn by Michael Myers in the original \"Halloween\" was actually a Captain Kirk mask painted white.",
  "Pearls melt in vinegar.",
  "In most advertisements, including newspapers, the time displayed on a watch is 10:10.",
  "All 50 states are listed across the top of the Lincoln Memorial on the back of the $5 bill.",
  "One quarter of the bones in your body are in your feet.",
  "On the ground, a group of geese is a gaggle, in the sky it is a skein.",
  "There were always 56 curls in Shirley Temple`s hair."
]