[
  "The word \"dexter\" whose meaning refers to the right hand is typed with only the left hand.  ",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\"",
  "Peanuts actually grow underground, as opposed to nuts like walnuts, almonds, etc. that grow on trees (and are sometimes referred to as \"tree nuts\"). Peanuts, along with beans and peas, belong to the single plant family, Leguminosae. Legumes are edible seeds enclosed in pods.",
  "The storage capacity of human brain exceeds 4 Terabytes.",
  "400-quarter pounders can be made from 1 cow.",
  "The letters KGB stand for Komitet Gosudarstvennoy Bezopasnosti.  ",
  "Mozart wrote the nursery rhyme `twinkle, twinkle, little star` at the age of 5.",
  "The world`s record for keeping a Lifesaver in the mouth with the hole intact is 7 hrs 10 min.",
  "Golf courses cover 4% of North America.",
  "The value of Pi will be officially \"rounded down\" to 3.14 from 3.14159265359 on December 31, 1999.",
  "Mike Nesmith`s (the guitarist of The Monkeys) mom invented White Out.",
  "Thirty-five percent of people who use personal ads for dating are already married.",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "A jellyfish is 95 percent water!",
  "The very first bomb dropped by the Allies on Berlin during World War II Killed the only elephant in the Berlin Zoo.",
  "The earth weighs around 6,588,000,000,000,000,000,000,000,000 tons.",
  "Dr. Kellogg introduced Kellogg`s Corn Flakes in hopes that it would reduce masturbation.",
  "The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word.",
  "Pamela Anderson Lee is Canada`s Centennial Baby, being the first baby born on the centennial anniversary of Canada`s independence."
]