[
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "Dentists have recommended that a toothbrush be kept at least 6 feet away from a toilet to avoid airborne particles resulting from the flush.",
  "Rhode Island is the only state which the hammer throw is a legal high school sport.",
  "The word \"samba\" means \"to rub navels together.\"",
  "Lorne Greene had one of his nipples bitten off by an alligator while he was host of \"Lorne Greene`s Wild Kingdom.\"",
  "All of the clocks in the movie \"Pulp Fiction\" are stuck on 4:20, a national pot-smokers hour.",
  "The characters Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the taxi driver in Frank Capra`s \"Its A Wonderful Life.\"",
  "The `Golden Arches` of fast food chain McDonalds is more recognized worldwide than the religious cross of Christianity.",
  "Hershey`s Kisses are called that because the machine that makes them looks like it`s kissing the conveyor belt.",
  "\"Underground\" is the only word in the English language that begins and ends with the letters \"und\"",
  " was Harrison Ford`s idea so that he could take a bathroom break.",
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world`s record for runners in the 100-years-or-older class. He was 101.",
  "Starfish haven`t got brains.",
  "Some individuals express concern sharing their soap, rightly so, considering 75% of all people wash from top to bottom.",
  "Camels have three eyelids to protect themselves from blowing sand!",
  "Most dust particles in your house are made from dead skin.",
  "Between 25% and 33% of the population sneeze when exposed to light.",
  "The muzzle of a lion is like a fingerprint - no two lions have the same pattern of whiskers.  ",
  "The average North American will eat 35,000 cookies during their life span.",
  "A pig`s orgasm lasts for 30 minutes."
]