[
  "In England, the Speaker of the House is not allowed to speak.",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "All US Presidents have worn glasses; some just didn`t like being seen wearing them in public.",
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "In every episode of Seinfeld there is a Superman somewhere.",
  "Until 1994, world maps and globes sold in Albania only had Albania on them.",
  "A `jiffy` is a unit of time for 1/100th of a second.",
  "In a test performed by Canadian scientists, using various different styles of music, it was determined that chickens lay the most eggs when pop music was played.",
  "A jellyfish is 95 percent water!",
  "For some time Frederic Chopin, the composer and pianist, wore a beard on only one side of his face, explaining: \"It does not matter, my audience sees only my right side.\"",
  "Intelligent people have more zinc and copper in their hair.",
  "A whale`s penis is called a dork.",
  "Some lions mate over 50 times a day.",
  "You were born with 300 bones, but by the time you are an adult you will only have 206.",
  "The Minneapolis phone book has 21 pages of Andersons.",
  "Q is the only letter in the alphabet that does not appear in the name of any of the United States!",
  "It costs more to buy a new car today in the United States than it cost Christopher Columbus to equip and undertake three voyages to and from the New World.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "Weatherman Willard Scott was the first original Ronald McDonald."
]