[
  "More Monopoly money is printed in a year, than real money throughout the world.",
  "To Ensure Promptness, one is expected to pay beyond the value of service – hence the later abbreviation: T.I.P.",
  "The male gypsy moth can \"smell\" the virgin female gypsy moth from 1.8 miles away.  ",
  "Celery has negative calories! It takes more calories to eat a piece of celery than the celery has in it.",
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "Nutmeg is extremely poisonous if injected intravenously.",
  "An eighteenth-century German named Matthew Birchinger, known as \"the little man of Nuremberg,\" played four musical instruments including the bagpipes, was an expert calligrapher, and was the most famous stage magician of his day. He performed tricks with the cup and balls that have never been explained. Yet Birchinger had no hands, legs, or thighs, and was less than 29 inches tall.",
  "A palindrome is a sentence or group of sentences that reads the same backwards as it does forward: Ex:  `Red rum, sir, is murder.` `Ma is as selfless as I am.` `Nurse, I spy gypsies. Run!`  `A man, a plan, a canal - Panama.` `He lived as a devil, eh?`",
  "The king of hearts is the only king without a mustache.",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "The verb \"cleave\" is the only English word with two synonyms which are antonyms of each other: adhere and separate.",
  "If the population of China walked past you in single file, the line would never end because of the rate of reproduction.",
  "The first automobile race ever seen in the United States was held in Chicago in 1895. The track ran from Chicago to Evanston, Illinois. The winner was J. Frank Duryea, whose average speed was 71/2 miles per hour.",
  "The placement of a donkey`s eyes in its` heads enables it to see all four feet at all times!",
  "A standard slinky measures 87 feet when stretched out.",
  "The value of Pi will be officially \"rounded down\" to 3.14 from 3.14159265359 on December 31, 1999.",
  "When the French Academy was preparing its first dictionary, it defined \"crab\" as, \"A small red fish, which walks backwards.\" This definition was sent with a number of others to the naturalist Cuvier for his approval. The scientist wrote back, \"Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards.\"",
  "On average, people fear spiders more than they do death.",
  "The average person falls asleep in seven minutes."
]