[
  "Spain leads the world in cork production",
  "The human tongue tastes bitter things with the taste buds toward the back. Salty and pungent flavors are tasted in the middle of the tongue, sweet flavors at the tip!",
  "The phrase \"rule of thumb\" is derived from an old English law, which stated that you couldn`t beat your wife with anything wider than your thumb.",
  "A standard slinky measures 87 feet when stretched out.",
  "There are two credit cards for every person in the United States.",
  "NBA superstar Michael Jordan was originally cut from his high school basketball team.",
  "A Boeing 747`s wingspan is longer than the Wright brother`s first flight.",
  "Valentine Tapley from Pike County, Missouri  grew chin whiskers attaining a length of twelve feet six inches from 1860 until his death 1910, protesting Abraham Lincoln`s election to the presidency.",
  "All of the clocks in the movie \"Pulp Fiction\" are stuck on 4:20, a national pot-smokers hour.",
  "The first CD pressed in the US was Bruce Springsteen`s `Born in the USA`",
  "The first automobile race ever seen in the United States was held in Chicago in 1895. The track ran from Chicago to Evanston, Illinois. The winner was J. Frank Duryea, whose average speed was 71/2 miles per hour.",
  "The first episode of \"Joanie Loves Chachi\" was the highest rated American program in the history of Korean television, a country where \"Chachi\" translates to \"penis\".  ",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game.",
  "You can`t kill yourself by holding your breath.  ",
  "Poland is the \"stolen car capital of the world\".",
  "Most collect calls are made on father`s day.",
  "The name of all continents in the world end with the same letter that they start with.",
  "A horse can look forward with one eye and back with the other.",
  "Coca-Cola was originally green.",
  "The longest recorded flight of a chicken is thirteen seconds."
]