[
  "Al Capone`s business card said he was a used furniture dealer.",
  "The word \"dexter\" whose meaning refers to the right hand is typed with only the left hand.  ",
  "NBA superstar Michael Jordan was originally cut from his high school basketball team.",
  "Most American car horns honk in the key of F.",
  "Kelsey Grammar sings and plays the piano for the theme song of Fraiser.",
  "Researchers at the Texas Department of Highways in Fort Worth determined the cow population of the U.S. burps some 50 million tons of valuable hydrocarbons into the atmosphere each year.  The accumulated burps of ten average cows could keep a small house adequately heated and its stove operating for a year.",
  "Until 1994, world maps and globes sold in Albania only had Albania on them.",
  "Almonds are a member of the peach family.",
  "A signature is called a John Hancock because he signed the Declaration of Independence. Only 2 people signed the declaration of independence on July 4. The Last person signed 2 years later.",
  "The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
  "Average number of people airborne over the US any given hour: 61,000.",
  "More people are killed annually by donkeys than airplane crashes.",
  "The sperm of a mouse is actually longer than the sperm of an elephant.",
  "Tom Sawyer was the first novel written on a typewriter.",
  "The name of the girl on the statue of liberty is Mother of Exiles.",
  "Women blink nearly twice as much as men.",
  "The citrus soda 7-UP was created in 1929; `7` was selected after the original 7-ounce containers and `UP` for the direction of the bubbles.",
  "Shakespeare is quoted 33,150 times in the Oxford English dictionary.",
  "A whale`s penis is called a dork.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods."
]