[
  "The average American butt is 14.9 inches long.",
  "Most toilets flush in E flat.",
  "A literal translation of a standard traffic sign in China: \"Give large space to the festive dog that makes sport in the roadway.\"",
  "The word \"Checkmate\" in chess comes from the Persian phrase \"Shah Mat,\" which means \"the king is dead.\"",
  "A standard slinky measures 87 feet when stretched out.",
  "The site with the highest number of women visitors between the age of 35 and 44 years old: Alka-Seltzer.com",
  "A family of 26 could go to the movies in Mexico city for the price of one in Tokyo.",
  "The storage capacity of human brain exceeds 4 Terabytes.",
  "Cranberries are sorted for ripeness by bouncing them; a fully ripened cranberry can be dribbled like a basketball.  ",
  "There are 336 dimples on a regulation golf ball.",
  "The highest per capita Jell-O comsumption in the US is Des Moines.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "One quarter of the bones in your body are in your feet.",
  "Pinocchio is Italian for \"pine head.\"",
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world`s record for runners in the 100-years-or-older class. He was 101.",
  "10,000 Dutch cows pass through the Amsterdam airport each year.",
  "Count the number of cricket chirps in a 15-second period, add 37 to the total, and your result will be very close to the actual outdoor Fahrenheit temperature.",
  "Weatherman Willard Scott was the first original Ronald McDonald.",
  "An eighteenth-century German named Matthew Birchinger, known as \"the little man of Nuremberg,\" played four musical instruments including the bagpipes, was an expert calligrapher, and was the most famous stage magician of his day. He performed tricks with the cup and balls that have never been explained. Yet Birchinger had no hands, legs, or thighs, and was less than 29 inches tall."
]