[
  "A Boeing 747s wingspan is longer than the Wright brother's first flight.",
  "1 in every 4 Americans has appeared someway or another on television.",
  "Los Angeles` full name `El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula` is reduced to 3.63% of its size in the abbreviation `L.A.`.",
  "It's impossible to sneeze with your eyes open.",
  "When the University of Nebraska Cornhuskers play football at home, the stadium becomes the state`s third largest city.",
  "A shrimp’s heart is in its head.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "The first toilet ever seen on television was on \"Leave It to Beaver.\"",
  "The Michelin man is known as Mr. Bib. His name was Bibendum in the company’s first ads in 1896.",
  "When you sneeze, air and particles travel through the nostrils at speeds over100 mph.  During this time, all bodily functions stop, including your heart, contributing to the impossibility of keeping one`s eyes open during a sneeze.",
  "The name for Oz in the \"Wizard of Oz\" was thought up when the creator, Frank Baum, looked at his filing cabinet and saw A-N, and O-Z; hence the name \"OZ.\"",
  "On average, 100 people choke to death on ball-point pens every year.",
  "The serial number of the first MAC ever produced was 2001.",
  "To escape the grip of a crocodile`s jaws, push your thumbs into its eyeballs - it will let you go instantly.",
  "Broccoli and cauliflower are the only vegetables that are flowers.",
  "If the population of China walked past you in single file, the line would never end because of the rate of reproduction.",
  "There are only four words in the English language which end in \"dous\": tremendous, horrendous, stupendous, and  hazardous.",
  "Only one in two billion people will live to be 116 or older.",
  "Humans and dolphins are the only species that have sex for pleasure.",
  "The mother of Michael Nesmith of \"The Monkees\" invented whiteout."
]