[
  "The Vatican city registered 0 births in 1983",
  "\"Evaluation and Parameterization of Stability and Safety Performance Characteristics of Two and Three Wheeled Vehicular Toys for Riding.\" Title of a $230,000 research project proposed by the Department of Health, Education and Welfare, to study the various ways children fall off bicycles.",
  "Half of all Americans live within 50 miles of their birthplace.",
  "The average American/Canadian will eat about 11.9 pounds of cereal per year!",
  "Length of beard an average man would grow if he never shaved 27.5 feet",
  "If we had the same mortality rate now as in 1900, more than half the people in the world today would not be alive.",
  "Reindeer like to eat bananas.",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning.",
  "3.6 cans of Spam are consumed each second.",
  "No word in the English language rhymes with month, orange, silver and purple.",
  "There are more psychoanalysts per capita in Buenos Aires than any other place in the world.",
  "A whale`s penis is called a dork.",
  "Bees have 5 eyes. There are 3 small eyes on the top of a bee`s head and 2 larger ones in front.",
  "Researchers at the Texas Department of Highways in Fort Worth determined the cow population of the U.S. burps some 50 million tons of valuable hydrocarbons into the atmosphere each year.  The accumulated burps of ten average cows could keep a small house adequately heated and its stove operating for a year.",
  "Peanuts actually grow underground, as opposed to nuts like walnuts, almonds, etc. that grow on trees (and are sometimes referred to as \"tree nuts\"). Peanuts, along with beans and peas, belong to the single plant family, Leguminosae. Legumes are edible seeds enclosed in pods.",
  "Virginia Woolf wrote all her books standing.",
  "Kelsey Grammar sings and plays the piano for the theme song of Fraiser.",
  "There are no clocks in Las Vegas gambling casinos.",
  "Barbie`s measurements, if she were life-size, would be 39-29-33."
]