[
  "Pinocchio is Italian for \"pine head.\"",
  "The San Francisco Cable cars are the only mobile National Monuments.",
  "The name Wendy was made up for the book \"Peter Pan.\"",
  "Valentine Tapley from Pike County, Missouri  grew chin whiskers attaining a length of twelve feet six inches from 1860 until his death 1910, protesting Abraham Lincoln`s election to the presidency.",
  "Studies show that if a cat falls off the seventh floor of a building it has about thirty percent less chance of surviving than a cat that falls off the twentieth floor. It supposedly takes about eight floors for the cat to realize what is occurring, relax and correct itself.",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\"",
  "If a rooster can`t fully extend its neck, it can`t crow.",
  "A dime has 118 ridges around the edge.",
  "The Black Widow spider eats her mate during or after sex.",
  "CBS` \"60 Minutes\" is the only TV show without a theme song/music.",
  "The Vatican city registered 0 births in 1983",
  "Only female mosquito’s` bite and most are attracted to the color blue twice as much as to any other color.",
  "The name of all continents in the world end with the same letter that they start with.",
  "There`s a systematic lull in conversation every 7 minutes.",
  "When the French Academy was preparing its first dictionary, it defined \"crab\" as, \"A small red fish, which walks backwards.\" This definition was sent with a number of others to the naturalist Cuvier for his approval. The scientist wrote back, \"Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards.\"",
  "In the marriage ceremony of the ancient Inca Indians of Peru, the couple was considered officially wed when they took off their sandals and handed them to each other.",
  "Americans travel 1,144,721,000 miles by air every day",
  "The most common street name in the U.S. is Second Street.",
  "Daffy Duck`s middle name is \"Dumas\"",
  "A piece of paper can be folded no more then 9 times."
]