[
  "The average person will accidentally eat just under a pound of insects every year.",
  "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane.",
  "When the French Academy was preparing its first dictionary, it defined \"crab\" as, \"A small red fish, which walks backwards.\" This definition was sent with a number of others to the naturalist Cuvier for his approval. The scientist wrote back, \"Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards.\"",
  "The buzz from an electric razor in America plays in the key of B flat; Key of G in England.",
  "In Bangladesh, kids as young as 15 can be jailed for cheating on their finals!",
  "Spain leads the world in cork production",
  "You can`t kill yourself by holding your breath.  ",
  "Deborah Winger did the voice of E.T.",
  "Clownfish, wrasses, moray eels, gobies and other fish species are known to change sex, including reproductive functions. A school of clownfish is always built into a hierarchy with a female fish at the top. When she dies, the most dominant male changes sex and takes her place.",
  "If you have three quarters, four dimes, and four pennies, you have $1.19, the largest amount of money in coins without being able to make change for a dollar.",
  "A literal translation of a standard traffic sign in China: \"Give large space to the festive dog that makes sport in the roadway.\"",
  "Walt Disney holds the world record for the most Academy Awards won by one person, he has won twenty statuettes, and twelve other plaques and certificates",
  "Donald Duck comics were banned from Finland because he doesn`t wear pants!",
  "Shakespeare invented the word `assassination` and `bump`.",
  "In Aspen Colorado, you can have a maximum income of $104,000 and still receive government subsidized housing.",
  "Bees have 5 eyes. There are 3 small eyes on the top of a bee`s head and 2 larger ones in front.",
  "NBA superstar Michael Jordan was originally cut from his high school basketball team.",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes.",
  "In most advertisements, including newspapers, the time displayed on a watch is 10:10.",
  "The name Jeep came from the abbreviation used in the army. G.P. for `General Purpose` vehicle."
]