[
  "Only 6 people in the whole world have died from moshing.",
  "Prince Charles is an avid collecter of toilet seats.",
  "There is a town in Newfoundland, Canada called Dildo.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning.",
  "The word Pennsylvania is misspelled on the Liberty Bell.",
  "The Great Wall of China is the only man-made structure visible from space.",
  "The following sentence: `A rough-coated, dough-faced, thoughtful ploughman strode through the streets of Scarborough; after falling into a slough, he coughed and hiccoughed.` Contains the nine different pronunciations of \"ough\" in the English Language.",
  "2,000 pounds of space dust and other space debris fall on the Earth every day.",
  "On an American one-dollar bill, there is an owl in the upper left-hand corner of the \"1\"encased in the \"shield\" and a spider hidden in the front upper right-hand corner.",
  "Mel Blanc (the voice of Bugs Bunny) was allergic to carrots.",
  "The Black Widow spider eats her mate during or after sex.",
  "Babies are born without kneecaps. They don`t appear until the child reaches 2-6 years of age.",
  "In eighteenth-century English gambling dens, there was an employee whose only job was to swallow the dice if there was a police raid.",
  "Ten percent of the Russian government`s income comes from the sale of vodka.",
  "Only female mosquito’s` bite and most are attracted to the color blue twice as much as to any other color.",
  "It is illegal to eat oranges while bathing in California.",
  "In 1912 a law passed in Nebraska where drivers in the country at night were required to stop every 150 yards, send up a skyrocket, wait eight minutes for the road to clear before proceeding cautiously, all the while blowing their horn and shooting off flares.",
  "Most Egyptians died by the time they were 30 about 300 years ago,",
  "Spain leads the world in cork production"
]