[
  "The fingerprints of koala bears are virtually indistinguishable from those of humans, so much so that they can be easily confused at a crime scene.",
  "Babies are born without kneecaps. They don`t appear until the child reaches 2-6 years of age.",
  "The verb \"cleave\" is the only English word with two synonyms which are antonyms of each other: adhere and separate.",
  "Dr. Jack Kevorkian first patient has Alzheimer`s disease.",
  "The giant squid has the largest eyes in the world.",
  "Former basketball superstar Michael Jordan is the most recognized face in the world, more than the pope himself.",
  "The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words.  More than 2 billion pencils are manufactured each year in the United States. If these were laid end to end they would circle the world nine times.",
  "On the ground, a group of geese is a gaggle, in the sky it is a skein.",
  "In 1778, fashionable women of Paris never went out in blustery weather without a lightning rod attached to their hats.",
  "The Ramses brand condom is named after the great pharoh Ramses II who fathered over 160 children.",
  "There were always 56 curls in Shirley Temple`s hair.",
  "Most Egyptians died by the time they were 30 about 300 years ago,",
  "Each of us generates about 3.5 pounds of rubbish a day, most of it paper.",
  "The only 15-letter word that can be spelled without repeating a letter is uncopyrightable.",
  "Honking of car horns for a couple that just got married is an old superstition to insure great sex.",
  "Months that begin on a Sunday will always have a `Friday the 13th`.",
  "Mr. Rogers is an ordained minister.",
  "Women manage the money and pay the bills in  75% of all Americans households.",
  "Ants closely resemble human manners:  When they wake, they stretch & appear to yawn in a human manner before taking up the tasks of the day.",
  "In Aspen Colorado, you can have a maximum income of $104,000 and still receive government subsidized housing."
]