[
  "Some lions mate over 50 times a day.",
  "Telly Savalas and Louis Armstrong died on their birthdays.  ",
  "In Miconesia, coins are 12 feet across.",
  "The eyes of a donkey are positioned so that it can see all four feet at all times.",
  "The average person will accidentally eat just under a pound of insects every year.",
  "The only real person to ever to appear on a pez dispenser was Betsy Ross.",
  "Facetious and abstemious contain all the vowels in the correct order, as does arsenious, meaning \"containing arsenic.\"  ",
  "The Main Library at Indiana University sinks over an inch every year because when it was built, engineers failed to take into account the weight of all the books that would occupy the building.",
  "Half the foods eaten throughout the world today were developed by farmers in the Andes Mountains (including potatoes, maize, sweet potatoes, squash, all varieties of beans, peanuts, manioc, papayas, strawberries, mulberries and many others).",
  "The HyperMart outside of Garland Texas has 58 check-outs.",
  "Two-thirds of the world`s eggplant is grown in New Jersey.  ",
  "The characters Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the taxi driver in Frank Capra`s \"Its A Wonderful Life.\"",
  "The first contraceptive was crocodile dung used by the ancient Egyptians.",
  "All of the clocks in the movie \"Pulp Fiction\" are stuck on 4:20, a national pot-smokers hour.",
  "The common idea that only 10% of the brain is used it not true as it is impossible to determine the actual percentage because of the complexity of the brain.",
  "the bird is the word",
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world`s record for runners in the 100-years-or-older class. He was 101.",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "Shakespeare invented the word `assassination` and `bump`."
]