[
  "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane.",
  "If the population of China walked past you in single file, the line would never end because of the rate of reproduction.",
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "This common everyday occurrence composed of 59% nitrogen, 21% hydrogen, and 9% dioxide is called a `fart`.",
  "Any free-moving liquid in outer space will form itself into a sphere, because of its surface tension.",
  "Jupiter is bigger than all the other planets in our solar system combined.",
  "All US Presidents have worn glasses; some just didn`t like being seen wearing them in public.",
  "Nearly 80% of all animals on earth have six legs.",
  "Approximately every seven minutes of every day, someone in an aerobics class pulls their hamstring.",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning.",
  "Celery has negative calories! It takes more calories to eat a piece of celery than the celery has in it.",
  "The phrase \"rule of thumb\" is derived from an old English law, which stated that you couldn`t beat your wife with anything wider than your thumb.",
  "The longest word comprised of one row on the keyboard is: TYPEWRITER",
  "Months that begin on a Sunday will always have a `Friday the 13th`.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "A horse can look forward with one eye and back with the other.",
  "The longest one-syllable word in the English language is \"screeched.\"",
  "Most Egyptians died by the time they were 30 about 300 years ago,",
  "Most lipstick contains fish scales!",
  "In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world."
]