[
  "In the marriage ceremony of the ancient Inca Indians of Peru, the couple was considered officially wed when they took off their sandals and handed them to each other.",
  "Canada makes up 6.67 percent of the Earth`s land area",
  "Studies have shown that children laugh an average of 300 times/day and adults 17 times/day, making the average child more optimistic, curious, and creative than the adult.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "In a test performed by Canadian scientists, using various different styles of music, it was determined that chickens lay the most eggs when pop music was played.",
  "Camels have three eyelids to protect themselves from blowing sand!",
  "All 50 states are listed across the top of the Lincoln Memorial on the back of the $5 bill.",
  "`Stewardesses` is the longest word that is typed with only the left hand.",
  "In the White House, there are 13,092 knives, forks and spoons!",
  "100% of lottery winners do gain weight",
  "A dragonfly has a lifespan of 24 hours.",
  "Until 1994, world maps and globes sold in Albania only had Albania on them.",
  "Fictional/horror writer Stephen King sleeps with a nearby light on to calm his fear of the dark. ",
  "The first episode of \"Joanie Loves Chachi\" was the highest rated American program in the history of Korean television, a country where \"Chachi\" translates to \"penis\".  ",
  "One of the reasons marijuana is illegal today is because cotton growers in the 1930s lobbied against hemp farmers they saw it as competition.",
  "Texas is also the only state that is allowed to fly its state flag at the same height as the U.S. flag.",
  "The only 15-letter word that can be spelled without repeating a letter is uncopyrightable.",
  "Annual growth of WWW traffic is 314,000%",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "Maine is the only state whose name is just one syllable."
]