[
  "2,000 pounds of space dust and other space debris fall on the Earth every day.",
  "Studies show that if a cat falls off the seventh floor of a building it has about thirty percent less chance of surviving than a cat that falls off the twentieth floor. It supposedly takes about eight floors for the cat to realize what is occurring, relax and correct itself.",
  "A dime has 118 ridges around the edge.",
  "There`s a systematic lull in conversation every 7 minutes.",
  "There are more psychoanalysts per capita in Buenos Aires than any other place in the world.",
  "The average person falls asleep in seven minutes.",
  "The \"save\" icon on Microsoft Word shows a floppy disk with the shutter on backwards.",
  "Barbie`s measurements, if she were life-size, would be 39-29-33.",
  "The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words.  More than 2 billion pencils are manufactured each year in the United States. If these were laid end to end they would circle the world nine times.",
  "Reindeer like to eat bananas.",
  "Only one person in two billion will live to be 116 or older.",
  "111,111,111 x 111,111,111 = 12,345,678,987,654,321",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes.",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "Tom Sawyer was the first novel written on a typewriter.",
  "If you yelled for 8 years, 7 months and 6 days, you will have produced enough sound energy to heat one cup of coffee.",
  "Fictional/horror writer Stephen King sleeps with a nearby light on to calm his fear of the dark. ",
  "The average American looks at eight houses before buying one.",
  "The very first bomb dropped by the Allies on Berlin during World War II Killed the only elephant in the Berlin Zoo.",
  "On an American one-dollar bill, there is an owl in the upper left-hand corner of the \"1\"encased in the \"shield\" and a spider hidden in the front upper right-hand corner."
]