[
  "The amount of computer Memory required to run WordPerfect for Win95 is 8 times the amount needed aboard the space shuttle.",
  "The expression `to get fired` comes from long ago Clans that wanted to get rid of unwanted people, so they would burn their houses instead of killing them, creating the term `Got fired`.",
  "When you sneeze, air and particles travel through the nostrils at speeds over100 mph.  During this time, all bodily functions stop, including your heart, contributing to the impossibility of keeping one`s eyes open during a sneeze.",
  "Blueberry Jelly Bellies were created especially for Ronald Reagan.",
  "In a test performed by Canadian scientists, using various different styles of music, it was determined that chickens lay the most eggs when pop music was played.",
  "One third of all cancers are sun related.",
  "Ants closely resemble human manners:  When they wake, they stretch & appear to yawn in a human manner before taking up the tasks of the day.",
  "The most common street name in the U.S. is Second Street.",
  "Dr. Jack Kevorkian first patient has Alzheimer`s disease.",
  "Tehran is the most expensive city on earth.",
  "A standard slinky measures 87 feet when stretched out.",
  "The citrus soda 7-UP was created in 1929; `7` was selected after the original 7-ounce containers and `UP` for the direction of the bubbles.",
  "You burn more calories sleeping than you do watching TV.",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "In Vermont, the ratio of cows to people is 10:1",
  "On an American one-dollar bill, there is an owl in the upper left-hand corner of the \"1\"encased in the \"shield\" and a spider hidden in the front upper right-hand corner.",
  "There are 1 million ants for every human in the world.",
  "The cruise liner, Queen Elizabeth II, moves only six inches for each gallon of diesel that it burns.",
  "A giraffe can go without water longer than a camel.",
  "The human heart creates enough pressure to squirt blood 30ft."
]