[
  "The giant squid has the largest eyes in the world.",
  "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane.",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "A duck`s quack doesn`t echo, and no one knows why.",
  "A dime has 118 ridges around the edge.",
  "The average lifespan of an eyelash is five months.",
  "Tom Sawyer was the first novel written on a typewriter.",
  "If you yelled for 8 years, 7 months and 6 days, you will have produced enough sound energy to heat one cup of coffee.",
  "Bullet proof vests, fire escapes, windshield wipers, and laser printers were all invented by women",
  "Peanuts actually grow underground, as opposed to nuts like walnuts, almonds, etc. that grow on trees (and are sometimes referred to as \"tree nuts\"). Peanuts, along with beans and peas, belong to the single plant family, Leguminosae. Legumes are edible seeds enclosed in pods.",
  "It costs more to buy a new car today in the United States than it cost Christopher Columbus to equip and undertake three voyages to and from the New World.",
  "The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word.",
  "It`s possible to lead a cow upstairs but not downstairs.",
  "1 in 8 Americans has worked at a McDonalds restaurant.",
  "Half the foods eaten throughout the world today were developed by farmers in the Andes Mountains (including potatoes, maize, sweet potatoes, squash, all varieties of beans, peanuts, manioc, papayas, strawberries, mulberries and many others).",
  "There are no clocks in Las Vegas gambling casinos.",
  "Tehran is the most expensive city on earth.",
  "The Earth experiences 50,000 Earth quakes per year and is hit by Lightning 100 times a second.",
  "Nutmeg is extremely poisonous if injected intravenously.",
  "A pig`s orgasm lasts for 30 minutes."
]