[
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world`s record for runners in the 100-years-or-older class. He was 101.",
  "The average North American will eat 35,000 cookies during their life span.",
  "You burn more calories sleeping than you do watching TV.",
  "When the University of Nebraska Cornhuskers play football at home, the stadium becomes the state`s third largest city.",
  "A `jiffy` is a unit of time for 1/100th of a second.",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game.",
  "The placement of a donkey`s eyes in its` heads enables it to see all four feet at all times!",
  "The 3 most valuable brand names on earth are Marlboro, Coca-Cola, and Budweiser (in that order).",
  "5,840 people with pillow related injuries checked into U.S. emergency rooms in 1992.",
  "If you went out into space, you would explode before you suffocated because there`s no air pressure.",
  "It costs more to buy a new car today in the United States than it cost Christopher Columbus to equip and undertake three voyages to and from the New World.",
  "The first episode of \"Joanie Loves Chachi\" was the highest rated American program in the history of Korean television, a country where \"Chachi\" translates to \"penis\".  ",
  "The average person will accidentally eat just under a pound of insects every year.",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\"",
  "The serial number of the first MAC ever produced was 2001.",
  "Texas is also the only state that is allowed to fly its state flag at the same height as the U.S. flag.",
  "The first automobile race ever seen in the United States was held in Chicago in 1895. The track ran from Chicago to Evanston, Illinois. The winner was J. Frank Duryea, whose average speed was 71/2 miles per hour.",
  "Most toilets flush in E flat.",
  "A signature is called a John Hancock because he signed the Declaration of Independence. Only 2 people signed the declaration of independence on July 4. The Last person signed 2 years later.",
  "Poland is the \"stolen car capital of the world\"."
]