[
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "When possums are playing `possum`, they are not \"playing.\" They actually pass out from sheer terror.",
  "THE MOST UNUSUAL CANNONBALL: On two occasions, Miss `Rita Thunderbird` remained inside the cannon despite a lot of gunpowder encouragement to do otherwise. She performed in a gold lamé bikini and on one of the two occasions (1977) Miss Thunderbird remained lodged in the cannon, while her bra was shot across the Thames River.",
  "The expression `to get fired` comes from long ago Clans that wanted to get rid of unwanted people, so they would burn their houses instead of killing them, creating the term `Got fired`.",
  "During a severe windstorm or rainstorm the Empire State Building sways several feet to either side.",
  "\"Evaluation and Parameterization of Stability and Safety Performance Characteristics of Two and Three Wheeled Vehicular Toys for Riding.\" Title of a $230,000 research project proposed by the Department of Health, Education and Welfare, to study the various ways children fall off bicycles.",
  "To Ensure Promptness, one is expected to pay beyond the value of service – hence the later abbreviation: T.I.P.",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "The Earth experiences 50,000 Earth quakes per year and is hit by Lightning 100 times a second.",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "Reindeer like to eat bananas.",
  "Peanuts are one of the ingredients of dynamite.",
  "Ingrown toenails are hereditary.  ",
  "On average, people fear spiders more than they do death.",
  "Only female mosquito’s` bite and most are attracted to the color blue twice as much as to any other color.",
  "A raisin dropped in a glass of fresh champagne will bounce up and down continually from the bottom of the glass to the top.",
  "CBS` \"60 Minutes\" is the only TV show without a theme song/music.",
  "Mel Blanc (the voice of Bugs Bunny) was allergic to carrots.",
  "Barbie`s measurements, if she were life-size, would be 39-29-33.",
  "Each king in a deck of playing cards represents a great king from history. Spades - King David, Clubs - Alexander the Great, Hearts - Charlemagne, and Diamonds - Julius Caesar."
]