[
  "Every acre of American crops harvested contains 100 pounds of insects.",
  "Starfish haven`t got brains.",
  "Pearls melt in vinegar.",
  "In 1980, a Las Vegas hospital suspended workers for betting on when patients would die.",
  "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane.",
  "Walt Disney holds the world record for the most Academy Awards won by one person, he has won twenty statuettes, and twelve other plaques and certificates",
  "There are 1,575 steps from the ground floor to the top of the Empire State building.",
  "Al Capone`s business card said he was a used furniture dealer.",
  "Fictional/horror writer Stephen King sleeps with a nearby light on to calm his fear of the dark. ",
  "In 1778, fashionable women of Paris never went out in blustery weather without a lightning rod attached to their hats.",
  "The `Golden Arches` of fast food chain McDonalds is more recognized worldwide than the religious cross of Christianity.",
  "Oak trees do not produce acorns until they are fifty years of age or older.",
  "A `jiffy` is a unit of time for 1/100th of a second.",
  "You can sail all the way around the world at latitude 60 degrees south.",
  "A family of 26 could go to the movies in Mexico city for the price of one in Tokyo.",
  "Over 60% of all those who marry get divorced.",
  "In 1986 Congress & President Ronald Reagan signed Public Law 99-359, which changed Daylight Saving Time from the last Sunday in April to the first Sunday in April.  It was estimated to save the nation about 300,000 barrels of oil each year by adding most of the month April to D.S.T.",
  "The muzzle of a lion is like a fingerprint - no two lions have the same pattern of whiskers.  ",
  "You burn more calories sleeping than you do watching TV.",
  "In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world."
]