[
  "The placement of a donkey`s eyes in its` heads enables it to see all four feet at all times!",
  "\"Underground\" is the only word in the English language that begins and ends with the letters \"und\"",
  "The average person will accidentally eat just under a pound of insects every year.",
  "Lawn darts are illegal in Canada.",
  "Each king in a deck of playing cards represents a great king from history. Spades - King David, Clubs - Alexander the Great, Hearts - Charlemagne, and Diamonds - Julius Caesar.",
  "The expression `to get fired` comes from long ago Clans that wanted to get rid of unwanted people, so they would burn their houses instead of killing them, creating the term `Got fired`.",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes.",
  "Who`s that playing the piano on the \"Mad About You\" theme? Paul Reiser himself.",
  "The word Pennsylvania is misspelled on the Liberty Bell.",
  "Einstein couldn`t speak fluently until after his ninth birthday. His parents thought he was mentally retarded.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "The longest recorded flight of a chicken is thirteen seconds.",
  "The phrase \"rule of thumb\" is derived from an old English law, which stated that you couldn`t beat your wife with anything wider than your thumb.",
  "The only nation whose name begins with an \"A\", but doesn`t end in an \"A\" is Afghanistan.",
  "Elephants are the only animals that can`t jump.",
  "In the early 1940s, the FCC assigned television`s Channel 1 to mobile services (like two-way radios in taxis) but did not re-number the other channel assignments.",
  "The mask worn by Michael Myers in the original \"Halloween\" was actually a Captain Kirk mask painted white.",
  "`Stewardesses` is the longest word that is typed with only the left hand.",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game."
]