[
  "Peanuts actually grow underground, as opposed to nuts like walnuts, almonds, etc. that grow on trees (and are sometimes referred to as \"tree nuts\"). Peanuts, along with beans and peas, belong to the single plant family, Leguminosae. Legumes are edible seeds enclosed in pods.",
  "The Eisenhower interstate system requires that one mile in every five must be straight in case of war or emergency, they could be used as airstrips.",
  "Tigers not only have striped fur, they have striped skin!",
  "Meteorologists claim they`re right 85% of the time (think about that one!)",
  "It takes 3,000 cows to supply the NFL with enough leather for a year`s supply of footballs.",
  "The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word.",
  "The San Francisco Cable cars are the only mobile National Monuments.",
  "Emus and kangaroos cannot walk backwards, and are on the Australian coat of arms for that reason.",
  "Poland is the \"stolen car capital of the world\".",
  "You can`t kill yourself by holding your breath.  ",
  "Intelligent people have more zinc and copper in their hair.",
  "The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary, because when it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites.",
  "Al Capone`s business card said he was a used furniture dealer.",
  "The Black Death reduced the population of Europe by one third in the period from 1347 to 1351.",
  "Women blink nearly twice as much as men.",
  "Cats urine glows under a black light.",
  "Walt Disney holds the world record for the most Academy Awards won by one person, he has won twenty statuettes, and twelve other plaques and certificates",
  "Studies show that if a cat falls off the seventh floor of a building it has about thirty percent less chance of surviving than a cat that falls off the twentieth floor. It supposedly takes about eight floors for the cat to realize what is occurring, relax and correct itself.",
  "In space, astronauts are unable to cry, because there is no gravity and the tears won`t flow.",
  "Over 1000 birds a year die from smashing into windows!"
]