[
  "Pamela Anderson Lee is Canada`s Centennial Baby, being the first baby born on the centennial anniversary of Canada`s independence.",
  "Because of the rotation of the earth, an object can be thrown farther if it is thrown west.",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
  "There were always 56 curls in Shirley Temple`s hair.",
  "Annual growth of WWW traffic is 314,000%",
  "Seattle’s Fremont Bridge rises up and down more than any drawbridge in the world.",
  "William Marston engineered one of the earliest forms of the polygraph in the early 1900`s. Later he went on to create the comic strip Wonder Woman, a story about a displaced Amazon princess who forces anyone caught in her magic lasso to tell the truth",
  "It`s possible to lead a cow upstairs but not downstairs.",
  "The average person`s left hand does 56% of the typing.",
  "It takes 3,000 cows to supply the NFL with enough leather for a year`s supply of footballs.",
  "In the 1980`s American migraines increased by 60%.",
  "If you go blind in one eye you only lose about one fifth of your vision but all your sense of depth.",
  "The 57 on Heinz ketchup bottles represents the number of varieties of pickles the company once had.",
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world`s record for runners in the 100-years-or-older class. He was 101.",
  "You can be fined up to $1,000 for whistling on Sunday in Salt Lake City, Utah.",
  "Reindeer like to eat bananas.",
  "The name of the girl on the statue of liberty is Mother of Exiles.",
  "Half the foods eaten throughout the world today were developed by farmers in the Andes Mountains (including potatoes, maize, sweet potatoes, squash, all varieties of beans, peanuts, manioc, papayas, strawberries, mulberries and many others).",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning."
]