[
  "William Marston engineered one of the earliest forms of the polygraph in the early 1900`s. Later he went on to create the comic strip Wonder Woman, a story about a displaced Amazon princess who forces anyone caught in her magic lasso to tell the truth",
  "The flea can jump 350 times its body length. It's like a human jumping the length of a football field.",
  "Worcestershire sauce in essentially an Anchovy Ketchup.",
  "The mask worn by Michael Myers in the original \"Halloween\" was actually a Captain Kirk mask painted white.",
  "The buzz from an electric razor in America plays in the key of B flat; Key of G in England.",
  "Ramses brand condom is named after the great pharaoh Ramses II who fathered over 160 children.",
  "Georgia's state motto is \"Wisdom, Justice and Moderation.\"",
  "1 in 5 of the world's doctors are Russian.",
  "Chewing gum while peeling onions will keep you from crying.",
  "14% of Americans have skinny-dipped with a member of the opposite sex at least once.",
  "Blueberry Jelly Bellies were created especially for Ronald Reagan.",
  "If you go blind in one eye you only lose about one fifth of your vision but all your sense of depth.",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\" ",
  "Rats multiply so quickly that in 18 months, two rats could have over million descendants.",
  "Virginia Woolf wrote all her books standing.",
  "The 57 on Heinz ketchup bottles represents the number of varieties of pickles the company once had.",
  "The “save” icon in Microsoft Office programs shows a floppy disk with the shutter on backwards.",
  "THE MOST UNUSUAL CANNONBALL: On two occasions, Miss `Rita Thunderbird` remained inside the cannon despite a lot of gunpowder encouragement to do otherwise. She performed in a gold lamé bikini and on one of the two occasions (1977) Miss Thunderbird remained lodged in the cannon, while her bra was shot across the Thames River.",
  "Your stomach produces a new layer of mucus every two weeks so that it doesn’t digest itself.",
  "Your heart beats over 100,000 times a day!"
]