[
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "Knock-knock. A race condition. Who is there?",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Where did the API go to eat? To the RESTaurant.",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "To understand what recursion is... You must first understand what recursion is",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "What do you call a cow with no legs? Ground beef!",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "What’s E.T. short for? He’s only got little legs.",
  "How do the trees get on the internet? They log on.",
  "Did you hear about the runner who was criticized? He just took it in stride",
  "What do you call someone with no nose? Nobody knows.",
  "Why are ghosts bad liars? Because you can see right through them!",
  "Did you hear about the bread factory burning down? They say the business is toast.",
  "I had a dream that I was a muffler last night. I woke up exhausted!",
  "Why did the worker get fired from the orange juice factory? Lack of concentration.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]