[
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
  "Want to hear a chimney joke? Got stacks of em! First one's on the house",
  "Why did Sweden start painting barcodes on the sides of their battleships? So they could Scandinavian.",
  "A ham sandwhich walks into a bar and orders a beer. The bartender says... I'm sorry, we don't serve food here",
  "Bad at golf? Join the club.",
  "What’s E.T. short for? He’s only got little legs.",
  "Why did the kid cross the playground? To get to the other slide.",
  "What did the mountain climber name his son? Cliff.",
  "Who is the coolest Doctor in the hospital? The hip Doctor!",
  "When a dad drives past a graveyard: Did you know that's a popular cemetery? Yep, people are just dying to get in there",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]