[
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "To understand what recursion is... You must first understand what recursion is",
  "Knock-knock. A race condition. Who is there?",
  "Why don't programmers like nature? Too many bugs.",
  "What goes after USA? USB.",
  "Where did the API go to eat? To the RESTaurant.",
  "Did you hear about the bread factory burning down? They say the business is toast.",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "What did the fish say when it swam into a wall? Damn!",
  "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.",
  "My older brother always tore the last pages of my comic books, and never told me why. I had to draw my own conclusions.",
  "What's the difference between a seal and a sea lion? An ion! ",
  "Why can't you use \"Beef stew\"as a password? Because it's not stroganoff.",
  "Where do you learn to make banana splits? At sundae school.",
  "Did you hear about the guy who invented Lifesavers? They say he made a mint.",
  "What cheese can never be yours? Nacho cheese.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]