[
  "Which song would an exception sing? Can't catch me - Avicii",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Where did the API go to eat? To the RESTaurant.",
  "What did the router say to the doctor? It hurts when IP.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "Why did the programmer go broke? He used up all his cache",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "What is this movie about? It is about 2 hours long.",
  "Why couldn't the bicycle stand up by itself? It was two-tired.",
  "What does an angry pepper do? It gets jalapeño face.",
  "Bad at golf? Join the club.",
  "What do you call a duck that gets all A's? A wise quacker.",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "What did one ocean say to the other ocean? Nothing, they just waved.",
  "If you're American when you go into the bathroom, and American when you come out, what are you when you're in there? European",
  "What kind of dinosaur loves to sleep? A stega-snore-us.",
  "When does a joke become a dad joke? When it becomes apparent.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]