[
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "What goes after USA? USB.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why don't programmers like nature? Too many bugs.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "What did the router say to the doctor? It hurts when IP.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "What's Forrest Gump's password? 1Forrest1",
  "What is a vampire's favorite fruit? A blood orange.",
  "What does a pirate pay for his corn? A buccaneer!",
  "Did you hear about the Mexican train killer? He had loco motives",
  "I just watched a documentary about beavers. It was the best dam show I ever saw",
  "What's the best thing about Switzerland? I don't know, but their flag is a big plus.",
  "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.",
  "What time is it? I don't know... it keeps changing.",
  "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
  "How did Darth Vader know what Luke was getting for Christmas? He felt his presents.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]