[
  "Why was the font always tired? It was always bold.",
  "Why did the programmer go broke? He used up all his cache",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "['hip', 'hip'] (hip hip array)",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "What goes after USA? USB.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "What happens to a frog's car when it breaks down? It gets toad away",
  "Did you hear about the hungry clock? It went back four seconds.",
  "I bought some shoes from a drug dealer. I don't know what he laced them with, but I was tripping all day!",
  "I just watched a documentary about beavers. It was the best dam show I ever saw",
  "How many seconds are in a year? 12. January 2nd, February 2nd, March 2nd, April 2nd.... etc",
  "Why are oranges the smartest fruit? Because they are made to concentrate. ",
  "How did the hipster burn the roof of his mouth? He ate the pizza before it was cool.",
  "How do you get a baby alien to sleep? You rocket.",
  "What do you get when you cross a snowman with a vampire? Frostbite.",
  "Why did Sweden start painting barcodes on the sides of their battleships? So they could Scandinavian.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]