[
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "Where do programmers like to hangout? The Foo Bar.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "Why was the font always tired? It was always bold.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "What kind of dinosaur loves to sleep? A stega-snore-us.",
  "What do you call a thieving alligator? A crookodile!",
  "I just watched a documentary about beavers. It was the best dam show I ever saw",
  "Did you know crocodiles could grow up to 15 feet? But most just have 4.",
  "What do you get when you cross a rabbit with a water hose? Hare spray.",
  "Where does batman go to the bathroom? The batroom.",
  "Why do bananas have to put on sunscreen before they go to the beach? Because they might peel!",
  "What do ghosts call their true love? Their ghoul-friend",
  "Why did the kid throw the watch out the window? So time would fly.",
  "What did one wall say to the other wall? I'll meet you at the corner!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]