[
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Why did the programmer go broke? He used up all his cache",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why was the font always tired? It was always bold.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the programmer quit their job? They didn't get arrays.",
  "How good are you at Power Point? I Excel at it.",
  "What kind of music do welders like? Heavy metal.",
  "What did the scarf say to the hat? You go on ahead, I am going to hang around a bit longer.",
  "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\"",
  "My older brother always tore the last pages of my comic books, and never told me why. I had to draw my own conclusions.",
  "What do you call fake spaghetti? An impasta.",
  "What did the ocean say to the shore? Nothing, it just waved.",
  "What did the fish say when it hit the wall? Dam.",
  "What do ghosts call their true love? Their ghoul-friend",
  "When is a door not a door? When it's ajar.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]