[
  "Why did the private classes break up? Because they never saw each other.",
  "Which song would an exception sing? Can't catch me - Avicii",
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "What did the router say to the doctor? It hurts when IP.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "What kind of dinosaur loves to sleep? A stega-snore-us.",
  "What do you call two barracuda fish? A Pairacuda!",
  "What did the janitor say when he jumped out of the closet? Supplies!",
  "How can you tell a vampire has a cold? They start coffin.",
  "How many seconds are in a year? 12. January 2nd, February 2nd, March 2nd, April 2nd.... etc",
  "What do you call a fake noodle? An impasta.",
  "Do you know what the word 'was' was initially? Before was was was was was is.",
  "What lies at the bottom of the ocean and twitches? A nervous wreck.",
  "Why did the butcher work extra hours at the shop? To make ends meat.",
  "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]