[
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "What creature is smarter than a talking parrot? A spelling bee.",
  "What do you call a singing Laptop? A Dell",
  "What does an angry pepper do? It gets jalapeño face.",
  "How does a French skeleton say hello? Bone-jour.",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "Want to hear a chimney joke? Got stacks of em! First one's on the house",
  "Who did the wizard marry? His ghoul-friend",
  "Why was the developer always calm? Because they knew how to handle exceptions.",
  "What kind of tree fits in your hand? A palm tree!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]