[
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the private classes break up? Because they never saw each other.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
  "What is the difference between ignorance and apathy? I don't know and I don't care.",
  "What do you call a boomerang that won't come back? A stick.",
  "What do you call a bee that lives in America? A USB.",
  "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans",
  "What time is it? I don't know... it keeps changing.",
  "What do you call a factory that sells passable products? A satisfactory",
  "Why is peter pan always flying? Because he neverlands",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "What’s the advantage of living in Switzerland? Well, the flag is a big plus.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]