[
  "Which song would an exception sing? Can't catch me - Avicii",
  "What did the router say to the doctor? It hurts when IP.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "To understand what recursion is... You must first understand what recursion is",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "What do you call cheese by itself? Provolone.",
  "What animal is always at a game of cricket? A bat.",
  "Why didn't the number 4 get into the nightclub? Because he is 2 square.",
  "Why did the rooster cross the road? He heard that the chickens at KFC were pretty hot.",
  "A grocery store cashier asked if I would like my milk in a bag. I told her 'No, thanks. The carton works fine.'",
  "How does a scientist freshen their breath? With experi-mints!",
  "Why did the mushroom get invited to the party? Because he was a fungi.",
  "Why did the melons plan a big wedding? Because they cantaloupe!",
  "Did you hear about the cow who jumped over the barbed wire fence? It was udder destruction.",
  "Why does a Moon-rock taste better than an Earth-rock? Because it's a little meteor.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]