[
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "What happens when you anger a brain surgeon? They will give you a piece of your mind.",
  "How does a penguin build it’s house? Igloos it together.",
  "What’s Forest Gump’s Facebook password? 1forest1",
  "Why are mummys scared of vacation? They're afraid to unwind.",
  "Ever wondered why bees hum? It's because they don't know the words.",
  "Why are oranges the smartest fruit? Because they are made to concentrate. ",
  "Did you hear about the kidnapping at school? It's ok, he woke up.",
  "Why can’t you hear a pterodactyl go to the bathroom? The p is silent.",
  "Why do wizards clean their teeth three times a day? To prevent bat breath!",
  "Why did the house go to the doctor? It was having window panes.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]