[
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the private classes break up? Because they never saw each other.",
  "To understand what recursion is... You must first understand what recursion is",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "What do you call an old snowman? Water.",
  "Did you hear that David lost his ID in prague? Now we just have to call him Dav.",
  "Did you hear about the two silk worms in a race? It ended in a tie.",
  "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
  "I got hit in the head by a soda can, but it didn't hurt that much... It was a soft drink.",
  "What did the beaver say to the tree? It's been nice gnawing you.",
  "Which side of the chicken has more feathers? The outside.",
  "How does a French skeleton say hello? Bone-jour.",
  "Why do scuba divers fall backwards into the water? Because if they fell forwards they’d still be in the boat.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]