[
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Where do programmers like to hangout? The Foo Bar.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Knock-knock. A race condition. Who is there?",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "What kind of pants do ghosts wear? Boo jeans.",
  "Why do crabs never give to charity? Because they’re shellfish.",
  "What did the digital clock say to the grandfather clock? Look, no hands!",
  "What did the judge say to the dentist? Do you swear to pull the tooth, the whole tooth and nothing but the tooth?",
  "You see, mountains aren't just funny. They are hill areas.",
  "How many hipsters does it take to change a lightbulb? Oh, it's a really obscure number. You've probably never heard of it.",
  "I couldn't get a reservation at the library... They were fully booked.",
  "What do you call a group of disorganized cats? A cat-tastrophe.",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\" Pop,goes the weasel.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]