[
  "Why don't programmers like nature? There's too many bugs.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Where did the API go to eat? To the RESTaurant.",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "Why did the private classes break up? Because they never saw each other.",
  "Knock-knock. A race condition. Who is there?",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "My older brother always tore the last pages of my comic books, and never told me why. I had to draw my own conclusions.",
  "What do you call a cow with no legs? Ground beef!",
  "Why did the mushroom get invited to the party? Because he was a fungi.",
  "What is the least spoken language in the world? Sign Language",
  "How do you make the number one disappear? Add the letter G and it’s “gone”!",
  "What did celery say when he broke up with his girlfriend? She wasn't right for me, so I really don't carrot all.",
  "Why do pumpkins sit on people’s porches? They have no hands to knock on the door.",
  "What do you call a cow on a trampoline? A milk shake!",
  "What do you call an Argentinian with a rubber toe? Roberto",
  "When a dad drives past a graveyard: Did you know that's a popular cemetery? Yep, people are just dying to get in there",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]