[
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "Why did the worker get fired from the orange juice factory? Lack of concentration.",
  "Why do birds fly south for the winter? Because it's too far to walk.",
  "What kind of dinosaur loves to sleep? A stega-snore-us.",
  "Why did the butcher work extra hours at the shop? To make ends meat.",
  "What kind of award did the dentist receive? A little plaque.",
  "What is the leading cause of dry skin? Towels",
  "How do you make the number one disappear? Add the letter G and it’s “gone”!",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "Why are mummys scared of vacation? They're afraid to unwind.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]