[
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "What's the object-oriented way to become wealthy? Inheritance",
  "Why did the programmer quit their job? They didn't get arrays.",
  "Why did the private classes break up? Because they never saw each other.",
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "Did you hear the joke about the wandering nun? She was a roman catholic.",
  "Why did the kid cross the playground? To get to the other slide.",
  "What do you call two barracuda fish? A Pairacuda!",
  "What did the Dorito farmer say to the other Dorito farmer? Cool Ranch!",
  "What do you call a factory that sells passable products? A satisfactory",
  "How does a scientist freshen their breath? With experi-mints!",
  "What's the difference between a hippo and a zippo? One is really heavy, the other is a little lighter.",
  "What do you call an alligator in a vest? An in-vest-igator!",
  "How do you get a baby alien to sleep? You rocket.",
  "Want to hear a joke about a piece of paper? Never mind...it's tearable",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]