[
  "Which song would an exception sing? Can't catch me - Avicii",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "Why was the font always tired? It was always bold.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why did the programmer go broke? He used up all his cache",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "When does a joke become a dad joke? When it becomes apparent.",
  "What's the worst thing about ancient history class? The teachers tend to Babylon.",
  "Did you hear about the hungry clock? It went back four seconds.",
  "What do you call a crowd of chess players bragging about their wins in a hotel lobby? Chess nuts boasting in an open foyer.",
  "Did you hear about the cheese factory that exploded in France? There was nothing left but de Brie.",
  "Why did the barber win the race? He took a short cut.",
  "What do you call a nervous javelin thrower? Shakespeare.",
  "Did you hear about the Viking who was reincarnated? He was Bjorn again",
  "What happens to a frog's car when it breaks down? It gets toad away",
  "What did the Zen Buddist say to the hotdog vendor? Make me one with everything.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]