[
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why did the programmer go broke? He used up all his cache",
  "Did you hear the one about the guy with the broken hearing aid? Neither did he.",
  "Why are mummys scared of vacation? They're afraid to unwind.",
  "Do you know where you can get chicken broth in bulk? The stock market.",
  "Why can't bicycles stand on their own? They are two tired",
  "What's Forrest Gump's password? 1Forrest1",
  "My older brother always tore the last pages of my comic books, and never told me why. I had to draw my own conclusions.",
  "What did Michael Jackson name his denim store? Billy Jeans!",
  "Why don't skeletons fight each other? They don't have the guts.",
  "What did the 0 say to the 8? Nice belt.",
  "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]