[
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "['hip', 'hip'] (hip hip array)",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Knock-knock. A race condition. Who is there?",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "did you know the first French fries weren't cooked in France? they were cooked in Greece",
  "What biscuit does a short person like? Shortbread. ",
  "What's the difference between a guitar and a fish? You can tune a guitar but you can't \"tuna\"fish!",
  "What do you call an eagle who can play the piano? Talonted!",
  "Why did the cowboy have a weiner dog? Somebody told him to get a long little doggy.",
  "Why are football stadiums so cool? Because every seat has a fan in it.",
  "Why couldn't the bicycle stand up by itself? It was two-tired.",
  "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays.",
  "How do the trees get on the internet? They log on.",
  "What do you give a sick lemon? Lemonaid.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]