[
  "Why did the private classes break up? Because they never saw each other.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "What did the router say to the doctor? It hurts when IP.",
  "What is the most used language in programming? Profanity.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "How do you make a hankie dance? Put a little boogie in it.",
  "Did you know crocodiles could grow up to 15 feet? But most just have 4.",
  "Due to complaints, Hawaii passed a law where you're not allowed to laugh above a certain decibel. You can only use a low ha.",
  "If you see a robbery at an Apple Store... Does that make you an iWitness?",
  "How do you find Will Smith in the snow? Look for fresh prints.",
  "What animal is always at a game of cricket? A bat.",
  "What is red and smells like blue paint? Red paint!",
  "What is the least spoken language in the world? Sign Language",
  "Where do bees go to the bathroom? The BP station.",
  "What did the late tomato say to the early tomato? I’ll ketch up",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]