[
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "['hip', 'hip'] (hip hip array)",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "What did the Java code say to the C code? You've got no class.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Where do programmers like to hangout? The Foo Bar.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why is peter pan always flying? Because he neverlands",
  "What do you call a group of disorganized cats? A cat-tastrophe.",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "Why did the opera singer go sailing? They wanted to hit the high Cs.",
  "Why did the man put his money in the freezer? He wanted cold hard cash!",
  "What happens when you anger a brain surgeon? They will give you a piece of your mind.",
  "Why does a chicken coop only have two doors? Because if it had four doors it would be a chicken sedan.",
  "What musical instrument is found in the bathroom? A tuba toothpaste.",
  "Why do ducks make great detectives? They always quack the case.",
  "Don't look at the eclipse through a colander. You'll strain your eyes.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]