[
  "Which song would an exception sing? Can't catch me - Avicii",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Knock-knock. A race condition. Who is there?",
  "Did you hear about the new restaurant on the moon? The food is great, but there’s just no atmosphere.",
  "Why didn't the skeleton go for prom? Because it had nobody.",
  "Who did the wizard marry? His ghoul-friend",
  "99.9% of the people are dumb! Fortunately I belong to the remaining 1%",
  "I'm reading a book about anti-gravity... It's impossible to put down",
  "Why do bees have sticky hair? Because they use honey combs!",
  "Why did the coffee file a police report? It got mugged.",
  "Can a kangaroo jump higher than the Empire State Building? Of course. The Empire State Building can't jump.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "What kind of shoes does a thief wear? Sneakers",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]