[
  "To understand what recursion is... You must first understand what recursion is",
  "['hip', 'hip'] (hip hip array)",
  "Where do programmers like to hangout? The Foo Bar.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why did the programmer go broke? He used up all his cache",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "If you're American when you go into the bathroom, and American when you come out, what are you when you're in there? European",
  "What kind of music do welders like? Heavy metal.",
  "What do you call a fat psychic? A four-chin teller.",
  "What did the Buffalo say to his little boy when he dropped him off at school? Bison.",
  "I started a new business making yachts in my attic this year... The sails are going through the roof.",
  "What do prisoners use to call each other? Cell phones.",
  "What do you call cheese by itself? Provolone.",
  "Why are graveyards so noisy? Because of all the coffin.",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "How much does a hipster weigh? An instagram.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]