[
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Where did the API go to eat? To the RESTaurant.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "Why don't programmers like nature? Too many bugs.",
  "What do you call a cow with two legs? Lean beef.",
  "What's a computer's favorite snack? Microchips.",
  "What do you call a crowd of chess players bragging about their wins in a hotel lobby? Chess nuts boasting in an open foyer.",
  "What do you call a factory that sells passable products? A satisfactory",
  "Finally realized why my plant sits around doing nothing all day... He loves his pot.",
  "What do you call a bear with no teeth? A gummy bear!",
  "What kind of award did the dentist receive? A little plaque.",
  "I got hit in the head by a soda can, but it didn't hurt that much... It was a soft drink.",
  "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\"",
  "What's blue and not very heavy? Light blue.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]