[
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "Why don't programmers like nature? Too many bugs.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "What do you call corn that joins the army? Kernel.",
  "What do you call a cow with no legs? Ground beef!",
  "What do you call a troublesome Canadian high schooler? A poutine.",
  "Which side of the chicken has more feathers? The outside.",
  "Why don't oysters give to charity? Because they're shellfish.",
  "Why can’t you hear a pterodactyl go to the bathroom? The p is silent.",
  "What did celery say when he broke up with his girlfriend? She wasn't right for me, so I really don't carrot all.",
  "When is a door not a door? When it's ajar.",
  "Why couldn't the bicycle stand up by itself? It was two-tired.",
  "How do you organize a space party? You planet.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]