[
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why don't programmers like nature? Too many bugs.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why do pirates not know the alphabet? They always get stuck at \"C\".",
  "What is red and smells like blue paint? Red paint!",
  "I started a new business making yachts in my attic this year... The sails are going through the roof.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "What's the best thing about Switzerland? I don't know, but their flag is a big plus.",
  "Why does a Moon-rock taste better than an Earth-rock? Because it's a little meteor.",
  "What do you call a careful wolf? Aware wolf.",
  "Ever wondered why bees hum? It's because they don't know the words.",
  "What do you call two barracuda fish? A Pairacuda!",
  "Do you want a brief explanation of what an acorn is? In a nutshell, it's an oak tree.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]