[
  "Why did the developer quit his job? Because he didn't get arrays.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why did the developer go broke? They kept spending all their cache.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Knock-knock. A race condition. Who is there?",
  "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
  "A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\" Pop,goes the weasel.",
  "What do you call a crowd of chess players bragging about their wins in a hotel lobby? Chess nuts boasting in an open foyer.",
  "Where do young cows eat lunch? In the calf-ateria.",
  "What do you get hanging from Apple trees? Sore arms.",
  "How do you fix a damaged jack-o-lantern? You use a pumpkin patch.",
  "What's orange and sounds like a parrot? A Carrot.",
  "What cheese can never be yours? Nacho cheese.",
  "Want to hear a joke about a piece of paper? Never mind...it's tearable",
  "Why did the kid throw the watch out the window? So time would fly.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]