[
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why don't programmers like nature? There's too many bugs.",
  "Where do programmers like to hangout? The Foo Bar.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "Knock-knock. A race condition. Who is there?",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "Why do Java programmers wear glasses? Because they don't C#.",
  "Why did the invisible man turn down the job offer? He couldn't see himself doing it",
  "Why did the coffee file a police report? It got mugged.",
  "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays.",
  "Why did the house go to the doctor? It was having window panes.",
  "Why do wizards clean their teeth three times a day? To prevent bat breath!",
  "Do you want a brief explanation of what an acorn is? In a nutshell, it's an oak tree.",
  "Why are skeletons so calm? Because nothing gets under their skin.",
  "What do birds give out on Halloween? Tweets.",
  "Why does Superman get invited to dinners? Because he is a Supperhero.",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]