[
  "Why did the private classes break up? Because they never saw each other.",
  "Why did the programmer quit their job? They didn't get arrays.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why don't programmers like nature? Too many bugs.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
  "What did celery say when he broke up with his girlfriend? She wasn't right for me, so I really don't carrot all.",
  "If you see a robbery at an Apple Store... Does that make you an iWitness?",
  "What did the pirate say on his 80th birthday? Aye Matey!",
  "Did you hear about the cow who jumped over the barbed wire fence? It was udder destruction.",
  "What did the traffic light say to the car as it passed? Don't look I'm changing!",
  "Why did the octopus beat the shark in a fight? Because it was well armed.",
  "If you boil a clown... Do you get a laughing stock?",
  "What do you call an old snowman? Water.",
  "Why did the cowboy have a weiner dog? Somebody told him to get a long little doggy.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]