[
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "What did the Java code say to the C code? You've got no class.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the private classes break up? Because they never saw each other.",
  "Knock-knock. A race condition. Who is there?",
  "What's the object-oriented way to become wealthy? Inheritance",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
  "What is a centipedes's favorite Beatle song? I want to hold your hand, hand, hand, hand...",
  "I dropped a pear in my car this morning. You should drop another one, then you would have a pair.",
  "While I was sleeping my friends decided to write math equations on me. You should have seen the expression on my face when I woke up.",
  "What animal is always at a game of cricket? A bat.",
  "What do you call a bear with no teeth? A gummy bear!",
  "What do you call a fake noodle? An impasta.",
  "My older brother always tore the last pages of my comic books, and never told me why. I had to draw my own conclusions.",
  "What was the pumpkin’s favorite sport? Squash.",
  "Why don't scientists trust atoms? Because they make up everything.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]