[
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "To understand what recursion is... You must first understand what recursion is",
  "How do you comfort a designer? You give them some space... between the elements.",
  "Why did the private classes break up? Because they never saw each other.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
  "Why did the half blind man fall in the well? Because he couldn't see that well!",
  "Why do wizards clean their teeth three times a day? To prevent bat breath!",
  "Did you know crocodiles could grow up to 15 feet? But most just have 4.",
  "What do you call a troublesome Canadian high schooler? A poutine.",
  "How do you know if there’s an elephant under your bed? Your head hits the ceiling!",
  "Did you hear about the guy who invented Lifesavers? They say he made a mint.",
  "Why did the butcher work extra hours at the shop? To make ends meat.",
  "What happens when you anger a brain surgeon? They will give you a piece of your mind.",
  "Why do crabs never give to charity? Because they’re shellfish.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]