[
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "Knock-knock. A race condition. Who is there?",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "What did the router say to the doctor? It hurts when IP.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Did you hear the one about the guy with the broken hearing aid? Neither did he.",
  "Did you hear about the new restaurant on the moon? The food is great, but there’s just no atmosphere.",
  "What did one snowman say to the other snow man? Do you smell carrot?",
  "Why was the developer always calm? Because they knew how to handle exceptions.",
  "What did the pirate say on his 80th birthday? Aye Matey!",
  "What's brown and sticky? A stick.",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "Have you heard the rumor going around about butter? Never mind, I shouldn't spread it.",
  "While I was sleeping my friends decided to write math equations on me. You should have seen the expression on my face when I woke up.",
  "Why are ghosts bad liars? Because you can see right through them!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]