[
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "What did the router say to the doctor? It hurts when IP.",
  "How do you find Will Smith in the snow? Look for fresh prints.",
  "Why can't a bicycle stand on its own? It's two-tired.",
  "What do you call someone with no nose? Nobody knows.",
  "Why does it take longer to get from 1st to 2nd base, than it does to get from 2nd to 3rd base? Because there’s a Shortstop in between!",
  "Why is peter pan always flying? Because he neverlands",
  "What kind of music do planets listen to? Nep-tunes.",
  "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans",
  "What do you call sad coffee? Despresso.",
  "What did the mountain climber name his son? Cliff.",
  "What did the 0 say to the 8? Nice belt.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]