[
  "Why did the programmer quit their job? They didn't get arrays.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "Why did the programmer go broke? He used up all his cache",
  "Why don't programmers like nature? Too many bugs.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why do bananas have to put on sunscreen before they go to the beach? Because they might peel!",
  "What’s Forest Gump’s Facebook password? 1forest1",
  "Why did the rooster cross the road? He heard that the chickens at KFC were pretty hot.",
  "Why are “Dad Jokes” so good? Because the punchline is apparent.",
  "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
  "What kind of dinosaur loves to sleep? A stega-snore-us.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "Why didn't the number 4 get into the nightclub? Because he is 2 square.",
  "Did you hear about the cheese factory that exploded in France? There was nothing left but de Brie.",
  "What do you get hanging from Apple trees? Sore arms.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]