[
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "A grocery store cashier asked if I would like my milk in a bag. I told her 'No, thanks. The carton works fine.'",
  "Why did the octopus beat the shark in a fight? Because it was well armed.",
  "Why do trees seem suspicious on sunny days? Dunno, they're just a bit shady.",
  "Why do crabs never give to charity? Because they’re shellfish.",
  "Want to hear a joke about a piece of paper? Never mind...it's tearable",
  "Have you ever heard of a music group called Cellophane? They mostly wrap.",
  "What animal is always at a game of cricket? A bat.",
  "Why did the belt go to prison? He held up a pair of pants!",
  "Why are fish easy to weigh? Because they have their own scales.",
  "How does a dyslexic poet write? Inverse.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]