[
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "What goes after USA? USB.",
  "Why don't programmers like nature? Too many bugs.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "What's the difference between a hippo and a zippo? One is really heavy, the other is a little lighter.",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "Is the pool safe for diving? It deep ends.",
  "What’s E.T. short for? He’s only got little legs.",
  "What's the best time to go to the dentist? Tooth hurty.",
  "How do you know if there’s an elephant under your bed? Your head hits the ceiling!",
  "What did the grape do when he got stepped on? He let out a little wine.",
  "Why did the rooster cross the road? He heard that the chickens at KFC were pretty hot.",
  "What did the Zen Buddist say to the hotdog vendor? Make me one with everything.",
  "How do you make a hankie dance? Put a little boogie in it.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]