[
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "What's the object-oriented way to become wealthy? Inheritance",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "What did the router say to the doctor? It hurts when IP.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "Why do crabs never give to charity? Because they’re shellfish.",
  "Where did you learn to make ice cream? Sunday school.",
  "What's the difference between a guitar and a fish? You can tune a guitar but you can't \"tuna\"fish!",
  "If you boil a clown... Do you get a laughing stock?",
  "What time is it? I don't know... it keeps changing.",
  "What do you do when you see a space man? Park your car, man.",
  "Did you hear the one about the guy with the broken hearing aid? Neither did he.",
  "What do you call a fat psychic? A four-chin teller.",
  "Why do pirates not know the alphabet? They always get stuck at \"C\".",
  "Why do birds fly south for the winter? Because it's too far to walk.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]