[
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "What did the router say to the doctor? It hurts when IP.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Did you watch the new comic book movie? It was very graphic!",
  "What do you call a cow with no legs? Ground beef!",
  "How do you make a tissue dance? You put a little boogie on it.",
  "What do you call a group of disorganized cats? A cat-tastrophe.",
  "Why are mummys scared of vacation? They're afraid to unwind.",
  "What did the Zen Buddist say to the hotdog vendor? Make me one with everything.",
  "What’s the difference between an African elephant and an Indian elephant? About 5000 miles.",
  "If you see a robbery at an Apple Store... Does that make you an iWitness?",
  "Why didn’t the skeleton cross the road? Because he had no guts.",
  "What's the best time to go to the dentist? Tooth hurty.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]