[
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the programmer quit their job? They didn't get arrays.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "What type of music do balloons hate? Pop music!",
  "How does the moon cut his hair? Eclipse it.",
  "Where do you learn to make banana splits? At sundae school.",
  "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
  "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "What do you get hanging from Apple trees? Sore arms.",
  "How does a penguin build it’s house? Igloos it together.",
  "What did the Red light say to the Green light? Don't look at me I'm changing!",
  "Did you hear about the cheese factory that exploded in France? There was nothing left but de Brie.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]