[
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the programmer quit their job? They didn't get arrays.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "To understand what recursion is... You must first understand what recursion is",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "What did the beaver say to the tree? It's been nice gnawing you.",
  "What's brown and sticky? A stick.",
  "What kind of bagel can fly? A plain bagel.",
  "Where do hamburgers go to dance? The meat-ball.",
  "What do you call a fly without wings? A walk.",
  "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
  "Why did the man run around his bed? Because he was trying to catch up on his sleep!",
  "What do you get when you cross a snowman with a vampire? Frostbite.",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]