[
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Which song would an exception sing? Can't catch me - Avicii",
  "Why did the programmer go broke? He used up all his cache",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "How do you comfort a designer? You give them some space... between the elements.",
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "How does a penguin build it’s house? Igloos it together.",
  "Why does Waldo only wear stripes? Because he doesn't want to be spotted.",
  "what do you call a dog that can do magic tricks? a labracadabrador",
  "How many hipsters does it take to change a lightbulb? Oh, it's a really obscure number. You've probably never heard of it.",
  "Did you hear that David lost his ID in prague? Now we just have to call him Dav.",
  "What did the traffic light say to the car as it passed? Don't look I'm changing!",
  "When is a door not a door? When it's ajar.",
  "What kind of bagel can fly? A plain bagel.",
  "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\"",
  "Why did the barber win the race? He took a short cut.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]