[
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the private classes break up? Because they never saw each other.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "Where did the API go to eat? To the RESTaurant.",
  "To understand what recursion is... You must first understand what recursion is",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "What did the Red light say to the Green light? Don't look at me I'm changing!",
  "What do you call a cow with two legs? Lean beef.",
  "What do I look like? A JOKE MACHINE!?",
  "What do you call a dad that has fallen through the ice? A Popsicle.",
  "How do you steal a coat? You jacket.",
  "What do you call cheese by itself? Provolone.",
  "How do you find Will Smith in the snow? Look for fresh prints.",
  "What did the scarf say to the hat? You go on ahead, I am going to hang around a bit longer.",
  "Why do bears have hairy coats? Fur protection.",
  "How do you make the number one disappear? Add the letter G and it’s “gone”!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]