[
  "Why did the programmer quit their job? They didn't get arrays.",
  "What did the Java code say to the C code? You've got no class.",
  "Where did the API go to eat? To the RESTaurant.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Which song would an exception sing? Can't catch me - Avicii",
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "What did Michael Jackson name his denim store? Billy Jeans!",
  "Why is peter pan always flying? Because he neverlands",
  "What do you call a dictionary on drugs? High definition.",
  "Did you hear that David lost his ID in prague? Now we just have to call him Dav.",
  "Did you know you should always take an extra pair of pants golfing? Just in case you get a hole in one.",
  "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
  "Did you know crocodiles could grow up to 15 feet? But most just have 4.",
  "Why can't your nose be 12 inches long? Because then it'd be a foot!",
  "Did you hear the joke about the wandering nun? She was a roman catholic.",
  "How does a train eat? It goes chew, chew",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]