[
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "What did the router say to the doctor? It hurts when IP.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why did the worker get fired from the orange juice factory? Lack of concentration.",
  "What do you call someone with no nose? Nobody knows.",
  "If you boil a clown... Do you get a laughing stock?",
  "Do you know where you can get chicken broth in bulk? The stock market.",
  "Have you heard of the band 1023MB? They haven't got a gig yet.",
  "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.",
  "What did one ocean say to the other ocean? Nothing, they just waved.",
  "Why are oranges the smartest fruit? Because they are made to concentrate. ",
  "Why are graveyards so noisy? Because of all the coffin.",
  "Hey, dad, did you get a haircut? No, I got them all cut.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]