[
  "Why did the programmer quit their job? They didn't get arrays.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Finally realized why my plant sits around doing nothing all day... He loves his pot.",
  "What did one snowman say to the other snow man? Do you smell carrot?",
  "Why did the golfer wear two pairs of pants? In case he got a hole in one.",
  "Why are fish so smart? Because they live in schools!",
  "Why did the tomato blush? Because it saw the salad dressing.",
  "I saw a nice stereo on Craigslist for $1. Seller says the volume is stuck on ‘high’ I couldn’t turn it down.",
  "When is a door not a door? When it's ajar.",
  "Have you heard of the band 1023MB? They haven't got a gig yet.",
  "What biscuit does a short person like? Shortbread. ",
  "I couldn't get a reservation at the library... They were fully booked.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]