[
  "Which song would an exception sing? Can't catch me - Avicii",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the programmer quit their job? They didn't get arrays.",
  "What is the most used language in programming? Profanity.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "To understand what recursion is... You must first understand what recursion is",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "What do you call a crowd of chess players bragging about their wins in a hotel lobby? Chess nuts boasting in an open foyer.",
  "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
  "What biscuit does a short person like? Shortbread. ",
  "Why don't you find hippopotamuses hiding in trees? They're really good at it.",
  "What do you call a duck that gets all A's? A wise quacker.",
  "99.9% of the people are dumb! Fortunately I belong to the remaining 1%",
  "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
  "Want to hear a chimney joke? Got stacks of em! First one's on the house",
  "Where does batman go to the bathroom? The batroom.",
  "What do you call a boomerang that won't come back? A stick.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]