[
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "What did the router say to the doctor? It hurts when IP.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why did the programmer go broke? He used up all his cache",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the private classes break up? Because they never saw each other.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why do pirates not know the alphabet? They always get stuck at \"C\".",
  "What musical instrument is found in the bathroom? A tuba toothpaste.",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague.",
  "What do you call a boomerang that won't come back? A stick.",
  "What do you call a cow with two legs? Lean beef.",
  "Why are graveyards so noisy? Because of all the coffin.",
  "While I was sleeping my friends decided to write math equations on me. You should have seen the expression on my face when I woke up.",
  "What do you give to a lemon in need? Lemonaid.",
  "Why did the tomato blush? Because it saw the salad dressing.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]