[
  "Why did the programmer quit their job? They didn't get arrays.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why did the developer go broke? They kept spending all their cache.",
  "Why don't programmers like nature? Too many bugs.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "Why was the font always tired? It was always bold.",
  "What is the most used language in programming? Profanity.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "Why do crabs never give to charity? Because they’re shellfish.",
  "What do you call an eagle who can play the piano? Talonted!",
  "Why did the opera singer go sailing? They wanted to hit the high Cs.",
  "What is a witch's favorite subject in school? Spelling!",
  "Did you hear the joke about the wandering nun? She was a roman catholic.",
  "Due to complaints, Hawaii passed a law where you're not allowed to laugh above a certain decibel. You can only use a low ha.",
  "Why does Superman get invited to dinners? Because he is a Supperhero.",
  "What did the Buffalo say to his little boy when he dropped him off at school? Bison.",
  "Why did the tree go to the dentist? It needed a root canal.",
  "What did the ocean say to the shore? Nothing, it just waved.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]