[
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "What is the most used language in programming? Profanity.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "To understand what recursion is... You must first understand what recursion is",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "What goes after USA? USB.",
  "Why don't programmers like nature? There's too many bugs.",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "I just watched a documentary about beavers. It was the best dam show I ever saw",
  "Did you hear the news? FedEx and UPS are merging. They’re going to go by the name Fed-Up from now on.",
  "Have you heard the rumor going around about butter? Never mind, I shouldn't spread it.",
  "What did the Zen Buddist say to the hotdog vendor? Make me one with everything.",
  "Who is the coolest Doctor in the hospital? The hip Doctor!",
  "What do vegetarian zombies eat? Grrrrrainnnnnssss.",
  "How was the snow globe feeling after the storm? A little shaken.",
  "What do you call a factory that sells passable products? A satisfactory",
  "How do hens stay fit? They always egg-cercise!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]