[
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why do Java programmers wear glasses? Because they don't C#.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
  "What creature is smarter than a talking parrot? A spelling bee.",
  "Why don't you find hippopotamuses hiding in trees? They're really good at it.",
  "Why did the kid cross the playground? To get to the other slide.",
  "What do you do on a remote island? Try and find the TV island it belongs to.",
  "I dropped a pear in my car this morning. You should drop another one, then you would have a pair.",
  "What do you give a sick lemon? Lemonaid.",
  "What do you call a nervous javelin thrower? Shakespeare.",
  "Did you hear about the kidnapping at school? It's ok, he woke up.",
  "What time is it? I don't know... it keeps changing.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]