[
  "What goes after USA? USB.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What time did the man go to the dentist? Tooth hurt-y.",
  "How many kids with ADD does it take to change a lightbulb? Let's go ride bikes!",
  "How much does a hipster weigh? An instagram.",
  "A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\" Pop,goes the weasel.",
  "I can't tell if i like this blender... It keeps giving me mixed results.",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "I dropped a pear in my car this morning. You should drop another one, then you would have a pair.",
  "What do you do on a remote island? Try and find the TV island it belongs to.",
  "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
  "Did you hear about the hungry clock? It went back four seconds.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]