[
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "How do you comfort a designer? You give them some space... between the elements.",
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "To understand what recursion is... You must first understand what recursion is",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "How many lips does a flower have? Tulips",
  "What did the left eye say to the right eye? Between us, something smells!",
  "Why can't you use \"Beef stew\"as a password? Because it's not stroganoff.",
  "How many kids with ADD does it take to change a lightbulb? Let's go ride bikes!",
  "Why does Waldo only wear stripes? Because he doesn't want to be spotted.",
  "What do you call a factory that sells passable products? A satisfactory",
  "Which side of the chicken has more feathers? The outside.",
  "How did the hipster burn the roof of his mouth? He ate the pizza before it was cool.",
  "Did you hear about the Viking who was reincarnated? He was Bjorn again",
  "How does the moon cut his hair? Eclipse it.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]