[
  "['hip', 'hip'] (hip hip array)",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "What is the most used language in programming? Profanity.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What did the Dorito farmer say to the other Dorito farmer? Cool Ranch!",
  "Where does batman go to the bathroom? The batroom.",
  "Why is peter pan always flying? Because he neverlands",
  "What do you call a nervous javelin thrower? Shakespeare.",
  "Can a kangaroo jump higher than the Empire State Building? Of course. The Empire State Building can't jump.",
  "Why do scuba divers fall backwards into the water? Because if they fell forwards they’d still be in the boat.",
  "How many apples grow on a tree? All of them!",
  "Why did the man run around his bed? Because he was trying to catch up on his sleep!",
  "How does a dyslexic poet write? Inverse.",
  "How do you fix a broken pizza? With tomato paste.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]