[
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why was the font always tired? It was always bold.",
  "Why did the programmer go broke? He used up all his cache",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "What's the object-oriented way to become wealthy? Inheritance",
  "Which song would an exception sing? Can't catch me - Avicii",
  "Why did the golfer wear two pairs of pants? In case he got a hole in one.",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "What did the Buffalo say to his little boy when he dropped him off at school? Bison.",
  "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays.",
  "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
  "How come a man driving a train got struck by lightning? He was a good conductor.",
  "Why didn't the skeleton go for prom? Because it had nobody.",
  "Why did the chicken cross the playground? To get to the other slide.",
  "What does an angry pepper do? It gets jalapeño face.",
  "What do you give to a lemon in need? Lemonaid.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]