[
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the developer go broke? They kept spending all their cache.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Why do Java programmers wear glasses? Because they don't C#.",
  "Where do programmers like to hangout? The Foo Bar.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "I had a dream that I was a muffler last night. I woke up exhausted!",
  "did you know the first French fries weren't cooked in France? they were cooked in Greece",
  "What do prisoners use to call each other? Cell phones.",
  "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
  "Dad, can you put my shoes on? I don't think they'll fit me.",
  "What's the worst thing about ancient history class? The teachers tend to Babylon.",
  "Bad at golf? Join the club.",
  "What did the mountain climber name his son? Cliff.",
  "What did the shy pebble wish for? That she was a little boulder.",
  "Why did the golfer wear two pairs of pants? In case he got a hole in one.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]