[
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the developer go broke? They kept spending all their cache.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "What is the most used language in programming? Profanity.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "A termite walks into a bar and says... 'Where is the bar tended?'",
  "Why do birds fly south for the winter? Because it's too far to walk.",
  "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\"",
  "Want to hear a chimney joke? Got stacks of em! First one's on the house",
  "Why did the man run around his bed? Because he was trying to catch up on his sleep!",
  "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
  "What’s the advantage of living in Switzerland? Well, the flag is a big plus.",
  "Did you hear about the crime in the parking garage? It was wrong on so many levels.",
  "What is the hardest part about sky diving? The ground.",
  "What do you call a droid that takes the long way around? R2 detour.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]