[
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Where do programmers like to hangout? The Foo Bar.",
  "Why do crabs never give to charity? Because they’re shellfish.",
  "What's the worst thing about ancient history class? The teachers tend to Babylon.",
  "What did the 0 say to the 8? Nice belt.",
  "What do you get when you cross a snowman with a vampire? Frostbite.",
  "How does a scientist freshen their breath? With experi-mints!",
  "Why do bees hum? Because they don't know the words.",
  "A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\" Pop,goes the weasel.",
  "What does C.S. Lewis keep at the back of his wardrobe? Narnia business!",
  "What is a centipedes's favorite Beatle song? I want to hold your hand, hand, hand, hand...",
  "What did the mountain climber name his son? Cliff.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]