[
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "Why don't programmers like nature? There's too many bugs.",
  "To understand what recursion is... You must first understand what recursion is",
  "Where do programmers like to hangout? The Foo Bar.",
  "When a dad drives past a graveyard: Did you know that's a popular cemetery? Yep, people are just dying to get in there",
  "How do you find Will Smith in the snow? Look for fresh prints.",
  "What musical instrument is found in the bathroom? A tuba toothpaste.",
  "Why is seven bigger than nine? Because seven ate nine.",
  "Want to hear my pizza joke? Never mind, it's too cheesy.",
  "What do vegetarian zombies eat? Grrrrrainnnnnssss.",
  "If you see a robbery at an Apple Store... Does that make you an iWitness?",
  "What do you call a group of killer whales playing instruments? An Orca-stra.",
  "What’s E.T. short for? He’s only got little legs.",
  "What is a witch's favorite subject in school? Spelling!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]