[
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What is the most used language in programming? Profanity.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "What did the router say to the doctor? It hurts when IP.",
  "Knock-knock. A race condition. Who is there?",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "To understand what recursion is... You must first understand what recursion is",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "What do you call an old snowman? Water.",
  "How good are you at Power Point? I Excel at it.",
  "What's the best thing about elevator jokes? They work on so many levels.",
  "Why did the belt go to prison? He held up a pair of pants!",
  "Why did the cookie go to the doctor?  Because it was feeling crumbly.",
  "What is the least spoken language in the world? Sign Language",
  "How many kids with ADD does it take to change a lightbulb? Let's go ride bikes!",
  "I'm reading a book about anti-gravity... It's impossible to put down",
  "Why does a chicken coop only have two doors? Because if it had four doors it would be a chicken sedan.",
  "Did you know crocodiles could grow up to 15 feet? But most just have 4.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]