[
  "Why did the programmer quit their job? They didn't get arrays.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why was the font always tired? It was always bold.",
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "What do you call a sheep with no legs? A cloud.",
  "Why does Waldo only wear stripes? Because he doesn't want to be spotted.",
  "Can February march? No, but April may.",
  "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays.",
  "A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\" Pop,goes the weasel.",
  "What do you get when you cross a snowman with a vampire? Frostbite.",
  "What's the worst thing about ancient history class? The teachers tend to Babylon.",
  "How does a penguin build it’s house? Igloos it together.",
  "Dad, can you put my shoes on? I don't think they'll fit me.",
  "What did the late tomato say to the early tomato? I’ll ketch up",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]