[
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "What is the most used language in programming? Profanity.",
  "Why was the font always tired? It was always bold.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "To understand what recursion is... You must first understand what recursion is",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why did the chicken cross the playground? To get to the other slide.",
  "How do you find Will Smith in the snow? Look for fresh prints.",
  "Did you hear the one about the guy with the broken hearing aid? Neither did he.",
  "What do you call cheese by itself? Provolone.",
  "What did the pirate say on his 80th birthday? Aye Matey!",
  "What do you call a boomerang that won't come back? A stick.",
  "What did the grape do when he got stepped on? He let out a little wine.",
  "Why did the half blind man fall in the well? Because he couldn't see that well!",
  "How does a scientist freshen their breath? With experi-mints!",
  "Why did the man run around his bed? Because he was trying to catch up on his sleep!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]