[
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Which song would an exception sing? Can't catch me - Avicii",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why was the JavaScript developer sad? He didn't know how to null his feelings.",
  "Why did the programmer always carry a pencil? They preferred to write in C#.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "Where do sheep go to get their hair cut? The baa-baa shop.",
  "How many tickles does it take to tickle an octopus? Ten-tickles!",
  "What do you call a bee that can't make up its mind? A maybe.",
  "What did the digital clock say to the grandfather clock? Look, no hands!",
  "What do you call a cow on a trampoline? A milk shake!",
  "How do you make the number one disappear? Add the letter G and it’s “gone”!",
  "What's blue and not very heavy? Light blue.",
  "What does an angry pepper do? It gets jalapeño face.",
  "How do you make a tissue dance? You put a little boogie on it.",
  "What do you call an eagle who can play the piano? Talonted!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]