[
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "['hip', 'hip'] (hip hip array)",
  "What is the most used language in programming? Profanity.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "How do you comfort a designer? You give them some space... between the elements.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What do you call a droid that takes the long way around? R2 detour.",
  "Why did the butcher work extra hours at the shop? To make ends meat.",
  "Did you hear about the guy whose whole left side was cut off? He's all right now.",
  "How do hens stay fit? They always egg-cercise!",
  "What did the judge say to the dentist? Do you swear to pull the tooth, the whole tooth and nothing but the tooth?",
  "How good are you at Power Point? I Excel at it.",
  "Why are mummys scared of vacation? They're afraid to unwind.",
  "Why can't a bicycle stand on its own? It's two-tired.",
  "What kind of bagel can fly? A plain bagel.",
  "Where did you learn to make ice cream? Sunday school.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]