[
  "To understand what recursion is... You must first understand what recursion is",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "How do you comfort a designer? You give them some space... between the elements.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "Which song would an exception sing? Can't catch me - Avicii",
  "Where did the API go to eat? To the RESTaurant.",
  "What type of music do balloons hate? Pop music!",
  "Why did the chicken get a penalty? For fowl play.",
  "Why are football stadiums so cool? Because every seat has a fan in it.",
  "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
  "When a dad drives past a graveyard: Did you know that's a popular cemetery? Yep, people are just dying to get in there",
  "What do you call corn that joins the army? Kernel.",
  "A ham sandwhich walks into a bar and orders a beer. The bartender says... I'm sorry, we don't serve food here",
  "Why do pumpkins sit on people’s porches? They have no hands to knock on the door.",
  "Who did the wizard marry? His ghoul-friend",
  "Two guys walk into a bar . . . The first guy says \"Ouch!\" and the second says \"Yeah, I didn't see it either.\"",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]