[
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "Why did the programmer's wife leave him? He didn't know how to commit.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "To understand what recursion is... You must first understand what recursion is",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "['hip', 'hip'] (hip hip array)",
  "Why do Java programmers wear glasses? Because they don't C#.",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "What did the grape do when he got stepped on? He let out a little wine.",
  "Where do young cows eat lunch? In the calf-ateria.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "What do you get when you cross a rabbit with a water hose? Hare spray.",
  "Why did the opera singer go sailing? They wanted to hit the high Cs.",
  "If you see a robbery at an Apple Store... Does that make you an iWitness?",
  "You see, mountains aren't just funny. They are hill areas.",
  "Why was the developer always calm? Because they knew how to handle exceptions.",
  "What's red and bad for your teeth? A Brick.",
  "What do you call a factory that sells passable products? A satisfactory",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]