[
  "Why did the designer break up with their font? Because it wasn't their type.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "Why don't programmers like nature? Too many bugs.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why was the font always tired? It was always bold.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "What did the grape do when he got stepped on? He let out a little wine.",
  "How do you make the number one disappear? Add the letter G and it’s “gone”!",
  "Why is seven bigger than nine? Because seven ate nine.",
  "What did the duck say when he bought lipstick? Put it on my bill",
  "How do you make a tissue dance? You put a little boogie on it.",
  "Why did the worker get fired from the orange juice factory? Lack of concentration.",
  "What do you get when you cross a rabbit with a water hose? Hare spray.",
  "What do you do when you see a space man? Park your car, man.",
  "What do you call two barracuda fish? A Pairacuda!",
  "What time did the man go to the dentist? Tooth hurt-y.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]