[
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why would a guitarist become a good programmer? He's adept at riffing in C#.",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why don't programmers like nature? There's too many bugs.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague.",
  "What happens when you anger a brain surgeon? They will give you a piece of your mind.",
  "A grocery store cashier asked if I would like my milk in a bag. I told her 'No, thanks. The carton works fine.'",
  "What do you call a dad that has fallen through the ice? A Popsicle.",
  "Finally realized why my plant sits around doing nothing all day... He loves his pot.",
  "Where does Fonzie like to go for lunch? Chick-Fil-Eyyyyyyyy.",
  "What kind of dinosaur loves to sleep? A stega-snore-us.",
  "What's blue and not very heavy? Light blue.",
  "Did you hear the story about the cheese that saved the world? It was legend dairy.",
  "How are false teeth like stars? They come out at night!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]