[
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "Knock-knock. A race condition. Who is there?",
  "How many React developers does it take to change a lightbulb? None, they prefer dark mode.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "What do elves post on Social Media? Elf-ies.",
  "What's the difference between a hippo and a zippo? One is really heavy, the other is a little lighter.",
  "Why are oranges the smartest fruit? Because they are made to concentrate. ",
  "How do you know if there’s an elephant under your bed? Your head hits the ceiling!",
  "Did you hear about the bread factory burning down? They say the business is toast.",
  "I started a new business making yachts in my attic this year... The sails are going through the roof.",
  "What kind of music do planets listen to? Nep-tunes.",
  "Do you know what the word 'was' was initially? Before was was was was was is.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "What does a pirate pay for his corn? A buccaneer!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!"
]