[
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "Which song would an exception sing? Can't catch me - Avicii",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "Why did the programmer quit their job? They didn't get arrays.",
  "Where did the API go to eat? To the RESTaurant.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why was the developer always calm? Because they knew how to handle exceptions.",
  "What do you call a fat psychic? A four-chin teller.",
  "If you're American when you go into the bathroom, and American when you come out, what are you when you're in there? European",
  "A ham sandwhich walks into a bar and orders a beer. The bartender says... I'm sorry, we don't serve food here",
  "What do you call a nervous javelin thrower? Shakespeare.",
  "Why didn’t the orange win the race? It ran out of juice.",
  "What do you call a laughing motorcycle? A Yamahahahaha.",
  "Can I watch the TV? Yes, but don’t turn it on.",
  "Did you hear about the two silk worms in a race? It ended in a tie.",
  "Why did the rooster cross the road? He heard that the chickens at KFC were pretty hot.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]