[
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "Where did the API go to eat? To the RESTaurant.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "Why was the font always tired? It was always bold.",
  "A user interface is like a joke. If you have to explain it then it is not that good.",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "What did the Java code say to the C code? You've got no class.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "What's the worst part about being a cross-eyed teacher? They can't control their pupils.",
  "Ever wondered why bees hum? It's because they don't know the words.",
  "What did one ocean say to the other ocean? Nothing, they just waved.",
  "How many seconds are in a year? 12. January 2nd, February 2nd, March 2nd, April 2nd.... etc",
  "What's the difference between a seal and a sea lion? An ion! ",
  "Where do rabbits go after they get married? On a bunny-moon.",
  "How do you organize a space party? You planet.",
  "Why did the man put his money in the freezer? He wanted cold hard cash!",
  "Is there a hole in your shoe? No… Then how’d you get your foot in it?",
  "Why did the cookie cry? Because his mother was a wafer so long",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]