[
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Lady: How do I spread love in this cruel world? Random Dude: [...💘]",
  "How do you generate a random string? Put a Windows user in front of Vim and tell them to exit.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "Knock-knock. A race condition. Who is there?",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "['hip', 'hip'] (hip hip array)",
  "What did the Java code say to the C code? You've got no class.",
  "A termite walks into a bar and says... 'Where is the bar tended?'",
  "What do you call a cow with two legs? Lean beef.",
  "I saw a nice stereo on Craigslist for $1. Seller says the volume is stuck on ‘high’ I couldn’t turn it down.",
  "What do you call an elephant that doesn’t matter? An irrelephant.",
  "Did you hear the news? FedEx and UPS are merging. They’re going to go by the name Fed-Up from now on.",
  "Why do wizards clean their teeth three times a day? To prevent bat breath!",
  "Did you hear about the kidnapping at school? It's ok, he woke up.",
  "Can I watch the TV? Yes, but don’t turn it on.",
  "did you know the first French fries weren't cooked in France? they were cooked in Greece",
  "How do you make a tissue dance? You put a little boogie on it.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]