[
  "Hey, wanna hear a joke? Parsing HTML with regex.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Where did the API go to eat? To the RESTaurant.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "Knock-knock. A race condition. Who is there?",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "How does a train eat? It goes chew, chew",
  "What do you call a sheep with no legs? A cloud.",
  "Why did the invisible man turn down the job offer? He couldn't see himself doing it",
  "Why did the math book look sad? Because it had too many problems.",
  "Why did the worker get fired from the orange juice factory? Lack of concentration.",
  "A grocery store cashier asked if I would like my milk in a bag. I told her 'No, thanks. The carton works fine.'",
  "Two guys walk into a bar . . . The first guy says \"Ouch!\" and the second says \"Yeah, I didn't see it either.\"",
  "Why can’t you hear a pterodactyl go to the bathroom? The p is silent.",
  "Why did the cowboy have a weiner dog? Somebody told him to get a long little doggy.",
  "What did one nut say as he chased another nut? I'm a cashew!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]