[
  "Where did the API go to eat? To the RESTaurant.",
  "Knock-knock. A race condition. Who is there?",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why did the programmer go broke? He used up all his cache",
  "What did the Java code say to the C code? You've got no class.",
  "What goes after USA? USB.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "How do the trees get on the internet? They log on.",
  "What biscuit does a short person like? Shortbread. ",
  "Why do pumpkins sit on people’s porches? They have no hands to knock on the door.",
  "How do you make a tissue dance? You put a little boogie on it.",
  "Why does it take longer to get from 1st to 2nd base, than it does to get from 2nd to 3rd base? Because there’s a Shortstop in between!",
  "Why did the coffee file a police report? It got mugged.",
  "Why did the kid throw the watch out the window? So time would fly.",
  "Hey, dad, did you get a haircut? No, I got them all cut.",
  "What do you call a crowd of chess players bragging about their wins in a hotel lobby? Chess nuts boasting in an open foyer.",
  "Why did the cowboy have a weiner dog? Somebody told him to get a long little doggy.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]