[
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why did the developer go to therapy? They had too many unresolved issues.",
  "Where do programmers like to hangout? The Foo Bar.",
  "What did the Java code say to the C code? You've got no class.",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why do Java programmers wear glasses? Because they don't C#.",
  "Why did the programmer go broke? He used up all his cache",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "Why did the man run around his bed? Because he was trying to catch up on his sleep!",
  "Why don't skeletons fight each other? They don't have the guts.",
  "What do you do when you see a space man? Park your car, man.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "Why can't bicycles stand on their own? They are two tired",
  "Did you hear about the crime in the parking garage? It was wrong on so many levels.",
  "What do you get hanging from Apple trees? Sore arms.",
  "Why are pirates called pirates? Because they arrr!",
  "What did Michael Jackson name his denim store? Billy Jeans!",
  "What is a centipedes's favorite Beatle song? I want to hold your hand, hand, hand, hand...",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]