[
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "How do you comfort a designer? You give them some space... between the elements.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why do Java programmers wear glasses? Because they don't C#.",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why did the chicken cross the playground? To get to the other slide.",
  "Why do valley girls hang out in odd numbered groups? Because they can't even.",
  "What do you call a cow with two legs? Lean beef.",
  "What did the ocean say to the shore? Nothing, it just waved.",
  "Why did Sweden start painting barcodes on the sides of their battleships? So they could Scandinavian.",
  "What did one snowman say to the other snow man? Do you smell carrot?",
  "What did one plate say to the other plate? Dinner is on me!",
  "Why didn't the number 4 get into the nightclub? Because he is 2 square.",
  "What do you call a singing Laptop? A Dell",
  "What is the least spoken language in the world? Sign Language",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]