[
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "Why dot net developers don't wear glasses? Because they see sharp.",
  "Why did the developer go broke? They kept spending all their cache.",
  "What's the best part about TCP jokes? I get to keep telling them until you get them.",
  "How do you comfort a designer? You give them some space... between the elements.",
  "A DHCP packet walks into a bar and asks for a beer. Bartender says, \"here, but I’ll need that back in an hour!\"",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "What do you call a fake noodle? An impasta.",
  "What lies at the bottom of the ocean and twitches? A nervous wreck.",
  "Did you hear about the two silk worms in a race? It ended in a tie.",
  "What do elves post on Social Media? Elf-ies.",
  "Did you know that protons have mass? I didn't even know they were catholic.",
  "Why are pirates called pirates? Because they arrr!",
  "What do you get when you cross a chicken with a skunk? A fowl smell!",
  "What do you get when you cross a bee and a sheep? A bah-humbug.",
  "Why do bears have hairy coats? Fur protection.",
  "Why are football stadiums so cool? Because every seat has a fan in it.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]