[
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "Why don't programmers like nature? There's too many bugs.",
  "Why did the private classes break up? Because they never saw each other.",
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out They couldn't find a table.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "A SQL query walks into a bar, walks up to two tables and asks... 'Can I join you?'",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "What goes after USA? USB.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "What's the difference between a guitar and a fish? You can tune a guitar but you can't \"tuna\"fish!",
  "What type of music do balloons hate? Pop music!",
  "What was the pumpkin’s favorite sport? Squash.",
  "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
  "How can you tell a vampire has a cold? They start coffin.",
  "What is the tallest building in the world? The library, it’s got the most stories!",
  "Why didn't the number 4 get into the nightclub? Because he is 2 square.",
  "Why didn’t the orange win the race? It ran out of juice.",
  "What's the best thing about Switzerland? I don't know, but their flag is a big plus.",
  "Why are fish so smart? Because they live in schools!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]