[
  "Where do programmers like to hangout? The Foo Bar.",
  "Why do programmers always get Christmas and Halloween mixed up? Because DEC 25 = OCT 31",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "What’s the object-oriented way to become wealthy? Inheritance.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "To understand what recursion is... You must first understand what recursion is",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "What do you call a computer mouse that swears a lot? A cursor!",
  "What do you call a droid that takes the long way around? R2 detour.",
  "Did you hear about the bread factory burning down? They say the business is toast.",
  "Why did the melons plan a big wedding? Because they cantaloupe!",
  "Why are graveyards so noisy? Because of all the coffin.",
  "What did the 0 say to the 8? Nice belt.",
  "How do you get two whales in a car? Start in England and drive West.",
  "Did you know you should always take an extra pair of pants golfing? Just in case you get a hole in one.",
  "I dropped a pear in my car this morning. You should drop another one, then you would have a pair.",
  "What do you do on a remote island? Try and find the TV island it belongs to.",
  "What did the grape do when he got stepped on? He let out a little wine.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!"
]