[
  "Why did the programmer quit their job? They didn't get arrays.",
  "Why did the developer quit his job? Because he didn't get arrays.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the functions stop calling each other? Because they had constant arguments.",
  "Where do programmers like to hangout? The Foo Bar.",
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Where did the API go to eat? To the RESTaurant.",
  "Why did the developer go broke buying Bitcoin? He kept calling it bytecoin and didn't get any.",
  "What did the late tomato say to the early tomato? I’ll ketch up",
  "What was a more important invention than the first telephone? The second one.",
  "Why did the half blind man fall in the well? Because he couldn't see that well!",
  "Where did you learn to make ice cream? Sunday school.",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "Why don't you find hippopotamuses hiding in trees? They're really good at it.",
  "What is a tornado's favorite game to play? Twister!",
  "What do you call a dad that has fallen through the ice? A Popsicle.",
  "How did the hipster burn the roof of his mouth? He ate the pizza before it was cool.",
  "When does a joke become a dad joke? When it becomes apparent.",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless."
]