[
  "There are 10 types of people in this world... Those who understand binary and those who don't",
  "Why did the designer break up with their font? Because it wasn't their type.",
  "Why did the developer break up with their keyboard? It just wasn't their type anymore.",
  "I was gonna tell you a joke about UDP... ...but you might not get it.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "Why did the programmer go to art school? He wanted to learn how to code outside the box.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "What's the object-oriented way to become wealthy? Inheritance",
  "Why don't React developers like nature? They prefer the virtual DOM.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Where do you learn to make banana splits? At sundae school.",
  "What did the spaghetti say to the other spaghetti? Pasta la vista, baby!",
  "What does a pirate pay for his corn? A buccaneer!",
  "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
  "What do you call a bee that lives in America? A USB.",
  "Why didn't the number 4 get into the nightclub? Because he is 2 square.",
  "Hey, dad, did you get a haircut? No, I got them all cut.",
  "Why did the coffee file a police report? It got mugged.",
  "What do you call an Argentinian with a rubber toe? Roberto",
  "What is the leading cause of dry skin? Towels",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!"
]