[
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "To understand what recursion is... You must first understand what recursion is",
  "Where do programmers like to hangout? The Foo Bar.",
  "Why was the designer always cold? Because they always used too much ice-olation.",
  "Why did the private classes break up? Because they never saw each other.",
  "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program the rest of them will write Perl",
  "Why did the programmer quit his job? Because he didn't get arrays.",
  "I got hit in the head by a soda can, but it didn't hurt that much... It was a soft drink.",
  "What did the scarf say to the hat? You go on ahead, I am going to hang around a bit longer.",
  "What do you call a girl between two posts? Annette.",
  "Why couldn't the kid see the pirate movie? Because it was rated arrr!",
  "What musical instrument is found in the bathroom? A tuba toothpaste.",
  "Why was Cinderalla thrown out of the football team? Because she ran away from the ball.",
  "Why do scuba divers fall backwards into the water? Because if they fell forwards they’d still be in the boat.",
  "Did you hear about the new restaurant on the moon? The food is great, but there’s just no atmosphere.",
  "If you're American when you go into the bathroom, and American when you come out, what are you when you're in there? European",
  "What is a tornado's favorite game to play? Twister!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]