[
  "Why did the programmer bring a ladder to work? They heard the code needed to be debugged from a higher level.",
  "What do you get when you cross a React developer with a mathematician? A function component.",
  "Why did the programmer bring a broom to work? To clean up all the bugs.",
  "The punchline often arrives before the set-up. Do you know the problem with UDP jokes?",
  "Why do programmers prefer dark chocolate? Because it's bitter like their code.",
  "Why did the programmer always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
  "I just got fired from my job at the keyboard factory. They told me I wasn't putting in enough shifts.",
  "Why don't programmers like nature? Too many bugs.",
  "How many programmers does it take to change a lightbulb? None that's a hardware problem",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer",
  "Do you know what the word 'was' was initially? Before was was was was was is.",
  "Why did the barber win the race? He took a short cut.",
  "Why don't scientists trust atoms? Because they make up everything.",
  "Did you hear the story about the cheese that saved the world? It was legend dairy.",
  "What time did the man go to the dentist? Tooth hurt-y.",
  "Why are pirates called pirates? Because they arrr!",
  "What do you call a pig that knows karate? A pork chop!",
  "What kind of music do welders like? Heavy metal.",
  "Why can't bicycles stand on their own? They are two tired",
  "You see, mountains aren't just funny. They are hill areas.",
  "Knock knock. \n Who's there? \n Little old lady. \n Little old lady who? I didn't know you could yodel!",
  "Knock knock. \n Who's there? \n Opportunity. That is impossible. Opportunity doesn’t come knocking twice!",
  "Knock knock. \n Who's there? \n Hatch. \n Hatch who? Bless you!",
  "Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who? Never mind. It's pointless.",
  "Knock knock. \n Who's there? \n Cows go. \n Cows go who? No, cows go moo."
]